[Survived] ArrayDeclaration
security/tool-allowlist.ts:3:31
 import { tridentLog } from '../utils.js';
 
-const ALLOWED_TOOLS = new Set([
-  'trident-audit',
-  'trident-status',
-  'trident-help',
-  'trident-vision',
-  'trident-gate',
-  'trident-code-audit',
-  'trident-deep-planning',
-  'trident-problem-solving',
-  'trident-context-synthesis',
-]);
+const ALLOWED_TOOLS = new Set([]);
 
 const ALLOWED_EXTERNAL_TOOLS = new Set([

[Survived] StringLiteral
security/tool-allowlist.ts:5:3
 
 const ALLOWED_TOOLS = new Set([
   'trident-audit',
-  'trident-status',
+  "",
   'trident-help',
   'trident-vision',

[Timeout] StringLiteral
security/tool-allowlist.ts:7:3
   'trident-audit',
   'trident-status',
   'trident-help',
-  'trident-vision',
+  "",
   'trident-gate',
   'trident-code-audit',

[Survived] StringLiteral
security/tool-allowlist.ts:8:3
   'trident-status',
   'trident-help',
   'trident-vision',
-  'trident-gate',
+  "",
   'trident-code-audit',
   'trident-deep-planning',

[Survived] StringLiteral
security/tool-allowlist.ts:12:3
   'trident-code-audit',
   'trident-deep-planning',
   'trident-problem-solving',
-  'trident-context-synthesis',
+  "",
 ]);
 

[Survived] ArrayDeclaration
security/tool-allowlist.ts:15:40
   'trident-context-synthesis',
 ]);
 
-const ALLOWED_EXTERNAL_TOOLS = new Set([
-  'read',
-  'glob',
-  'grep',
-  'webfetch',
-  'hive_context',
-  'hive-context',
-  'hive_status',
-  'hive-status',
-  'hive_context_absorb',
-  'hive-context-absorb',
-]);
+const ALLOWED_EXTERNAL_TOOLS = new Set([]);
 
 function isToolAllowed(toolName: string): boolean {

[Survived] StringLiteral
security/tool-allowlist.ts:17:3
 
 const ALLOWED_EXTERNAL_TOOLS = new Set([
   'read',
-  'glob',
+  "",
   'grep',
   'webfetch',

[Survived] StringLiteral
security/tool-allowlist.ts:18:3
 const ALLOWED_EXTERNAL_TOOLS = new Set([
   'read',
   'glob',
-  'grep',
+  "",
   'webfetch',
   'hive_context',

[Survived] StringLiteral
security/tool-allowlist.ts:19:3
   'read',
   'glob',
   'grep',
-  'webfetch',
+  "",
   'hive_context',
   'hive-context',

[Survived] StringLiteral
security/tool-allowlist.ts:22:3
   'webfetch',
   'hive_context',
   'hive-context',
-  'hive_status',
+  "",
   'hive-status',
   'hive_context_absorb',

[Survived] StringLiteral
security/tool-allowlist.ts:24:3
   'hive-context',
   'hive_status',
   'hive-status',
-  'hive_context_absorb',
+  "",
   'hive-context-absorb',
 ]);

[Survived] StringLiteral
security/tool-allowlist.ts:25:3
   'hive_status',
   'hive-status',
   'hive_context_absorb',
-  'hive-context-absorb',
+  "",
 ]);
 

[Survived] BlockStatement
security/tool-allowlist.ts:28:51
   'hive-context-absorb',
 ]);
 
-function isToolAllowed(toolName: string): boolean {
-  if (!toolName || typeof toolName !== 'string') return false;
-  const lower = toolName.toLowerCase();
-  if (ALLOWED_TOOLS.has(lower)) return true;
-  if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
-  for (const allowed of ALLOWED_EXTERNAL_TOOLS) {
-    if (lower.startsWith(allowed)) return true;
-  }
-  tridentLog('WARN', 'tool-allowlist', `DENIED tool: ${toolName} (not in allowlist)`);
-  return false;
-}
+function isToolAllowed(toolName: string): boolean {}
 
 export { isToolAllowed, ALLOWED_TOOLS, ALLOWED_EXTERNAL_TOOLS };

[Survived] LogicalOperator
security/tool-allowlist.ts:29:7
 ]);
 
 function isToolAllowed(toolName: string): boolean {
-  if (!toolName || typeof toolName !== 'string') return false;
+  if (!toolName && typeof toolName !== 'string') return false;
   const lower = toolName.toLowerCase();
   if (ALLOWED_TOOLS.has(lower)) return true;

[Survived] EqualityOperator
security/tool-allowlist.ts:29:20
 ]);
 
 function isToolAllowed(toolName: string): boolean {
-  if (!toolName || typeof toolName !== 'string') return false;
+  if (!toolName || typeof toolName === 'string') return false;
   const lower = toolName.toLowerCase();
   if (ALLOWED_TOOLS.has(lower)) return true;

[Survived] MethodExpression
security/tool-allowlist.ts:30:17
 
 function isToolAllowed(toolName: string): boolean {
   if (!toolName || typeof toolName !== 'string') return false;
-  const lower = toolName.toLowerCase();
+  const lower = toolName.toUpperCase();
   if (ALLOWED_TOOLS.has(lower)) return true;
   if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;

[Survived] ConditionalExpression
security/tool-allowlist.ts:31:7
 function isToolAllowed(toolName: string): boolean {
   if (!toolName || typeof toolName !== 'string') return false;
   const lower = toolName.toLowerCase();
-  if (ALLOWED_TOOLS.has(lower)) return true;
+  if (false) return true;
   if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
   for (const allowed of ALLOWED_EXTERNAL_TOOLS) {

[Survived] ConditionalExpression
security/tool-allowlist.ts:31:7
 function isToolAllowed(toolName: string): boolean {
   if (!toolName || typeof toolName !== 'string') return false;
   const lower = toolName.toLowerCase();
-  if (ALLOWED_TOOLS.has(lower)) return true;
+  if (true) return true;
   if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
   for (const allowed of ALLOWED_EXTERNAL_TOOLS) {

[Survived] ConditionalExpression
security/tool-allowlist.ts:32:7
   if (!toolName || typeof toolName !== 'string') return false;
   const lower = toolName.toLowerCase();
   if (ALLOWED_TOOLS.has(lower)) return true;
-  if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
+  if (false) return true;
   for (const allowed of ALLOWED_EXTERNAL_TOOLS) {
     if (lower.startsWith(allowed)) return true;

[Survived] ConditionalExpression
security/tool-allowlist.ts:32:7
   if (!toolName || typeof toolName !== 'string') return false;
   const lower = toolName.toLowerCase();
   if (ALLOWED_TOOLS.has(lower)) return true;
-  if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
+  if (true) return true;
   for (const allowed of ALLOWED_EXTERNAL_TOOLS) {
     if (lower.startsWith(allowed)) return true;

[Survived] BlockStatement
security/tool-allowlist.ts:33:49
   const lower = toolName.toLowerCase();
   if (ALLOWED_TOOLS.has(lower)) return true;
   if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
-  for (const allowed of ALLOWED_EXTERNAL_TOOLS) {
-    if (lower.startsWith(allowed)) return true;
-  }
+  for (const allowed of ALLOWED_EXTERNAL_TOOLS) {}
   tridentLog('WARN', 'tool-allowlist', `DENIED tool: ${toolName} (not in allowlist)`);
   return false;

[Survived] ConditionalExpression
security/tool-allowlist.ts:34:9
   if (ALLOWED_TOOLS.has(lower)) return true;
   if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
   for (const allowed of ALLOWED_EXTERNAL_TOOLS) {
-    if (lower.startsWith(allowed)) return true;
+    if (true) return true;
   }
   tridentLog('WARN', 'tool-allowlist', `DENIED tool: ${toolName} (not in allowlist)`);

[Survived] BooleanLiteral
security/tool-allowlist.ts:34:43
   if (ALLOWED_TOOLS.has(lower)) return true;
   if (ALLOWED_EXTERNAL_TOOLS.has(lower)) return true;
   for (const allowed of ALLOWED_EXTERNAL_TOOLS) {
-    if (lower.startsWith(allowed)) return true;
+    if (lower.startsWith(allowed)) return false;
   }
   tridentLog('WARN', 'tool-allowlist', `DENIED tool: ${toolName} (not in allowlist)`);

[Survived] BooleanLiteral
security/tool-allowlist.ts:37:10
     if (lower.startsWith(allowed)) return true;
   }
   tridentLog('WARN', 'tool-allowlist', `DENIED tool: ${toolName} (not in allowlist)`);
-  return false;
+  return true;
 }
 
