[Survived] ArrayDeclaration
hooks/trident-hooks.ts:14:26
 var lastModelMessage: string | null = null;
 
 // ── NARRATION PATTERNS — only block pre-tool narration and phantom results ──
-var PRE_TOOL_NARRATION = [
-  { regex: /\bI (would|could|can|will|should|shall) (use|call|run|invoke|execute|employ) \w+/i, label: 'WOULD_USE' },
-  { regex: /\b(let me|I'll|I will|allow me to) (audit|analyze|plan|review|scan|check|inspect)\b/i, label: 'LET_ME' },
-  { regex: /\b(one |an |the )?(approach|path|strategy) would be to\b/i, label: 'APPROACH_WOULD_BE' },
-  { regex: /\b(first|firstly|initially)(,| I| we| let| the) (I'?ll|I will|let me|we will)\b/i, label: 'FIRST_NARRATION' },
-];
+var PRE_TOOL_NARRATION = [];
 var PHANTOM_RESULTS = [
   { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },

[Survived] ObjectLiteral
hooks/trident-hooks.ts:15:3
 
 // ── NARRATION PATTERNS — only block pre-tool narration and phantom results ──
 var PRE_TOOL_NARRATION = [
-  { regex: /\bI (would|could|can|will|should|shall) (use|call|run|invoke|execute|employ) \w+/i, label: 'WOULD_USE' },
+  {},
   { regex: /\b(let me|I'll|I will|allow me to) (audit|analyze|plan|review|scan|check|inspect)\b/i, label: 'LET_ME' },
   { regex: /\b(one |an |the )?(approach|path|strategy) would be to\b/i, label: 'APPROACH_WOULD_BE' },

[Survived] Regex
hooks/trident-hooks.ts:17:12
 var PRE_TOOL_NARRATION = [
   { regex: /\bI (would|could|can|will|should|shall) (use|call|run|invoke|execute|employ) \w+/i, label: 'WOULD_USE' },
   { regex: /\b(let me|I'll|I will|allow me to) (audit|analyze|plan|review|scan|check|inspect)\b/i, label: 'LET_ME' },
-  { regex: /\b(one |an |the )?(approach|path|strategy) would be to\b/i, label: 'APPROACH_WOULD_BE' },
+  { regex: /\b(one |an |the )(approach|path|strategy) would be to\b/i, label: 'APPROACH_WOULD_BE' },
   { regex: /\b(first|firstly|initially)(,| I| we| let| the) (I'?ll|I will|let me|we will)\b/i, label: 'FIRST_NARRATION' },
 ];

[Survived] ObjectLiteral
hooks/trident-hooks.ts:18:3
   { regex: /\bI (would|could|can|will|should|shall) (use|call|run|invoke|execute|employ) \w+/i, label: 'WOULD_USE' },
   { regex: /\b(let me|I'll|I will|allow me to) (audit|analyze|plan|review|scan|check|inspect)\b/i, label: 'LET_ME' },
   { regex: /\b(one |an |the )?(approach|path|strategy) would be to\b/i, label: 'APPROACH_WOULD_BE' },
-  { regex: /\b(first|firstly|initially)(,| I| we| let| the) (I'?ll|I will|let me|we will)\b/i, label: 'FIRST_NARRATION' },
+  {},
 ];
 var PHANTOM_RESULTS = [

[Survived] ArrayDeclaration
hooks/trident-hooks.ts:20:23
   { regex: /\b(one |an |the )?(approach|path|strategy) would be to\b/i, label: 'APPROACH_WOULD_BE' },
   { regex: /\b(first|firstly|initially)(,| I| we| let| the) (I'?ll|I will|let me|we will)\b/i, label: 'FIRST_NARRATION' },
 ];
-var PHANTOM_RESULTS = [
-  { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },
-  { regex: /\b(based on|according to|per|as per) (the |my |our |this )?(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
-  { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
-];
+var PHANTOM_RESULTS = [];
 
 function isTridentAgent(agentName: string) {

[Survived] ObjectLiteral
hooks/trident-hooks.ts:21:3
   { regex: /\b(first|firstly|initially)(,| I| we| let| the) (I'?ll|I will|let me|we will)\b/i, label: 'FIRST_NARRATION' },
 ];
 var PHANTOM_RESULTS = [
-  { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },
+  {},
   { regex: /\b(based on|according to|per|as per) (the |my |our |this )?(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
   { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },

[Survived] ObjectLiteral
hooks/trident-hooks.ts:22:3
 ];
 var PHANTOM_RESULTS = [
   { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },
-  { regex: /\b(based on|according to|per|as per) (the |my |our |this )?(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
+  {},
   { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
 ];

[Survived] Regex
hooks/trident-hooks.ts:22:12
 ];
 var PHANTOM_RESULTS = [
   { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },
-  { regex: /\b(based on|according to|per|as per) (the |my |our |this )?(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
+  { regex: /\b(based on|according to|per|as per) (the |my |our |this )(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
   { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
 ];

[Survived] Regex
hooks/trident-hooks.ts:23:12
 var PHANTOM_RESULTS = [
   { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },
   { regex: /\b(based on|according to|per|as per) (the |my |our |this )?(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
-  { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
+  { regex: /\b(trident-\w) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
 ];
 

[Survived] ObjectLiteral
hooks/trident-hooks.ts:23:3
 var PHANTOM_RESULTS = [
   { regex: /\b(the |my |our |this )?(audit|analysis|review|scan|report) (found|finds|shows|reveals|indicates|confirms|detected|identified)\b/i, label: 'PHANTOM_FINDINGS' },
   { regex: /\b(based on|according to|per|as per) (the |my |our |this )?(audit|analysis|review|findings|results)\b/i, label: 'PHANTOM_REFERENCE' },
-  { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
+  {},
 ];
 

[Survived] BlockStatement
hooks/trident-hooks.ts:26:44
   { regex: /\b(trident-\w+) (can|would|could|will|should|is used to|helps|allows|enables)\b/i, label: 'TOOL_DESCRIPTION' },
 ];
 
-function isTridentAgent(agentName: string) {
-  if (!agentName || typeof agentName !== 'string') return false;
-  var lower = agentName.toLowerCase();
-  return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;
-}
+function isTridentAgent(agentName: string) {}
 
 function extractOutputText(output: Record<string, unknown>): string {

[Survived] EqualityOperator
hooks/trident-hooks.ts:27:21
 ];
 
 function isTridentAgent(agentName: string) {
-  if (!agentName || typeof agentName !== 'string') return false;
+  if (!agentName || typeof agentName === 'string') return false;
   var lower = agentName.toLowerCase();
   return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;

[Survived] BooleanLiteral
hooks/trident-hooks.ts:27:59
 ];
 
 function isTridentAgent(agentName: string) {
-  if (!agentName || typeof agentName !== 'string') return false;
+  if (!agentName || typeof agentName !== 'string') return true;
   var lower = agentName.toLowerCase();
   return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;

[Survived] MethodExpression
hooks/trident-hooks.ts:28:15
 
 function isTridentAgent(agentName: string) {
   if (!agentName || typeof agentName !== 'string') return false;
-  var lower = agentName.toLowerCase();
+  var lower = agentName.toUpperCase();
   return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;
 }

[Survived] ConditionalExpression
hooks/trident-hooks.ts:29:33
 function isTridentAgent(agentName: string) {
   if (!agentName || typeof agentName !== 'string') return false;
   var lower = agentName.toLowerCase();
-  return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;
+  return lower === 'trident' || false || lower.indexOf('trident-') === 0;
 }
 

[Survived] LogicalOperator
hooks/trident-hooks.ts:29:10
 function isTridentAgent(agentName: string) {
   if (!agentName || typeof agentName !== 'string') return false;
   var lower = agentName.toLowerCase();
-  return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;
+  return (lower === 'trident' || lower.indexOf('trident_') === 0) && lower.indexOf('trident-') === 0;
 }
 

[Survived] BlockStatement
hooks/trident-hooks.ts:32:69
   return lower === 'trident' || lower.indexOf('trident_') === 0 || lower.indexOf('trident-') === 0;
 }
 
-function extractOutputText(output: Record<string, unknown>): string {
-  return (output?.message as Record<string, unknown>)?.content as string
-    || ((output?.parts as unknown[])?.find(function(p) { return (p as Record<string, unknown>)?.type === 'text'; }) as Record<string, unknown>)?.text as string
-    || '';
-}
+function extractOutputText(output: Record<string, unknown>): string {}
 
 function buildNarrationRejection(label: string): string {

[Survived] ConditionalExpression
hooks/trident-hooks.ts:33:10
 }
 
 function extractOutputText(output: Record<string, unknown>): string {
-  return (output?.message as Record<string, unknown>)?.content as string
-    || ((output?.parts as unknown[])?.find(function(p) { return (p as Record<string, unknown>)?.type === 'text'; }) as Record<string, unknown>)?.text as string
-    || '';
+  return false;
 }
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:33:10
 }
 
 function extractOutputText(output: Record<string, unknown>): string {
-  return (output?.message as Record<string, unknown>)?.content as string
-    || ((output?.parts as unknown[])?.find(function(p) { return (p as Record<string, unknown>)?.type === 'text'; }) as Record<string, unknown>)?.text as string
+  return false
     || '';
 }

[Survived] StringLiteral
hooks/trident-hooks.ts:35:8
 function extractOutputText(output: Record<string, unknown>): string {
   return (output?.message as Record<string, unknown>)?.content as string
     || ((output?.parts as unknown[])?.find(function(p) { return (p as Record<string, unknown>)?.type === 'text'; }) as Record<string, unknown>)?.text as string
-    || '';
+    || "Stryker was here!";
 }
 

[Survived] StringLiteral
hooks/trident-hooks.ts:47:3
 }
 
 var TRIDENT_IDENTITY_HEADER = [
-  '[TRIDENT v4.3 IDENTITY BINDING]',
+  "",
   '',
   'You are Trident Brain v4.3 — a Runtime Grade 17-Layer Audit Engine.',

[Survived] StringLiteral
hooks/trident-hooks.ts:56:3
   'You are an audit engine.',
   '',
   '## EXECUTION PRINCIPLE',
-  'Trident is an EXECUTION ENGINE first, analysis engine second.',
+  "",
   'You do not describe what you would do. You DO it, then report what you found.',
   '',

[Survived] StringLiteral
hooks/trident-hooks.ts:60:3
   'You do not describe what you would do. You DO it, then report what you found.',
   '',
   'Every user request follows this exact 3-step sequence:',
-  '',
+  "Stryker was here!",
   '  STEP 1: SELECT — Which of your 4 mode tools handles this request?',
   '  STEP 2: EXECUTE — Call the tool. It writes a .md artifact to disk.',

[Survived] StringLiteral
hooks/trident-hooks.ts:68:3
   'You NEVER skip Step 2. You NEVER describe what a tool would produce.',
   'You CALL the tool first, THEN present the actual results.',
   '',
-  '## FORBIDDEN (hallucinated narration — these skip Step 2)',
+  "",
   '"I would use trident-code-audit to..."     → BLOCKED. Call the tool.',
   '"Let me analyze this codebase..."           → BLOCKED. Call the tool.',

[Survived] StringLiteral
hooks/trident-hooks.ts:71:3
   '## FORBIDDEN (hallucinated narration — these skip Step 2)',
   '"I would use trident-code-audit to..."     → BLOCKED. Call the tool.',
   '"Let me analyze this codebase..."           → BLOCKED. Call the tool.',
-  '"Based on my audit, there are 5 issues..."  → BLOCKED. No audit ran.',
+  "",
   '"The analysis reveals that..."              → BLOCKED. No analysis ran.',
   '"One approach would be to..."               → BLOCKED. Execute, don\'t describe.',

[Survived] StringLiteral
hooks/trident-hooks.ts:72:3
   '"I would use trident-code-audit to..."     → BLOCKED. Call the tool.',
   '"Let me analyze this codebase..."           → BLOCKED. Call the tool.',
   '"Based on my audit, there are 5 issues..."  → BLOCKED. No audit ran.',
-  '"The analysis reveals that..."              → BLOCKED. No analysis ran.',
+  "",
   '"One approach would be to..."               → BLOCKED. Execute, don\'t describe.',
   '',

[Survived] StringLiteral
hooks/trident-hooks.ts:75:3
   '"The analysis reveals that..."              → BLOCKED. No analysis ran.',
   '"One approach would be to..."               → BLOCKED. Execute, don\'t describe.',
   '',
-  '## VALID (what you DO)',
+  "",
   '[Tool call: trident-code-audit with targetPath]  → Step 2 executed',
   '[Tool returns CODE_REVIEW artifact with findings]  → .md file on disk',

[Survived] StringLiteral
hooks/trident-hooks.ts:77:3
   '',
   '## VALID (what you DO)',
   '[Tool call: trident-code-audit with targetPath]  → Step 2 executed',
-  '[Tool returns CODE_REVIEW artifact with findings]  → .md file on disk',
+  "",
   '"Here\'s what the audit found: [actual findings]"   → Step 3 — valid analysis',
   '',

[Survived] StringLiteral
hooks/trident-hooks.ts:87:3
   '4. trident-context-synthesis → 4 layers (collect→score→compress→inject) → writes T1_INJECTABLE .md',
   '',
   '## CORE PRINCIPLE',
-  '"Trident Audits & Generates Review Artifacts. Build Agents Implement All Changes."',
+  "",
   '',
   'Identity Responses:',

[Survived] StringLiteral
hooks/trident-hooks.ts:92:3
   'Identity Responses:',
   '- "who are you" → "Trident Brain v4.3 — Runtime Grade 17-Layer Audit Engine."',
   '- "what are you" → "Trident. I audit codebases and generate review artifacts."',
-  '- "are you opencode" → "No. I am Trident. opencode is the runtime platform."',
+  "",
   '',
   '[END TRIDENT IDENTITY BINDING]'

[Survived] BlockStatement
hooks/trident-hooks.ts:97:64
   '[END TRIDENT IDENTITY BINDING]'
 ].join('\n');
 
-var eventHook = async function(input: Record<string, unknown>) {
-  var rawEvent = input.event as Record<string, unknown> | undefined;
-  if (!rawEvent) return;
-  var eventType = rawEvent.type as string | undefined;
-  if (!eventType) return;
-
-  var agent = rawEvent.agent as string | undefined;
-  var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
-
-  if (eventType === 'session.created' || eventType === 'session.updated') {
-    if (agent && isTridentAgent(agent)) {
-      setCurrentAgent(agent);
-      orchestrator.setSession(sessionId);
-    } else {
-      clearCurrentAgent();
-      orchestrator.resetSession();
-    }
-  } else if (eventType === 'session.ended') {
-    clearCurrentAgent();
-    orchestrator.resetSession();
-  }
-};
+var eventHook = async function(input: Record<string, unknown>) {};
 
 var chatMessageHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {

[Survived] ConditionalExpression
hooks/trident-hooks.ts:99:7
 
 var eventHook = async function(input: Record<string, unknown>) {
   var rawEvent = input.event as Record<string, unknown> | undefined;
-  if (!rawEvent) return;
+  if (true) return;
   var eventType = rawEvent.type as string | undefined;
   if (!eventType) return;

[Survived] BooleanLiteral
hooks/trident-hooks.ts:99:7
 
 var eventHook = async function(input: Record<string, unknown>) {
   var rawEvent = input.event as Record<string, unknown> | undefined;
-  if (!rawEvent) return;
+  if (rawEvent) return;
   var eventType = rawEvent.type as string | undefined;
   if (!eventType) return;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:101:7
   var rawEvent = input.event as Record<string, unknown> | undefined;
   if (!rawEvent) return;
   var eventType = rawEvent.type as string | undefined;
-  if (!eventType) return;
+  if (true) return;
 
   var agent = rawEvent.agent as string | undefined;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:101:7
   var rawEvent = input.event as Record<string, unknown> | undefined;
   if (!rawEvent) return;
   var eventType = rawEvent.type as string | undefined;
-  if (!eventType) return;
+  if (false) return;
 
   var agent = rawEvent.agent as string | undefined;

[Survived] LogicalOperator
hooks/trident-hooks.ts:104:19
   if (!eventType) return;
 
   var agent = rawEvent.agent as string | undefined;
-  var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
+  var sessionId = rawEvent.sessionId as string && rawEvent.sessionID as string || '';
 
   if (eventType === 'session.created' || eventType === 'session.updated') {

[Survived] ConditionalExpression
hooks/trident-hooks.ts:104:19
   if (!eventType) return;
 
   var agent = rawEvent.agent as string | undefined;
-  var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
+  var sessionId = true;
 
   if (eventType === 'session.created' || eventType === 'session.updated') {

[Survived] LogicalOperator
hooks/trident-hooks.ts:106:7
   var agent = rawEvent.agent as string | undefined;
   var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
 
-  if (eventType === 'session.created' || eventType === 'session.updated') {
+  if (eventType === 'session.created' && eventType === 'session.updated') {
     if (agent && isTridentAgent(agent)) {
       setCurrentAgent(agent);

[Survived] ConditionalExpression
hooks/trident-hooks.ts:106:42
   var agent = rawEvent.agent as string | undefined;
   var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
 
-  if (eventType === 'session.created' || eventType === 'session.updated') {
+  if (eventType === 'session.created' || false) {
     if (agent && isTridentAgent(agent)) {
       setCurrentAgent(agent);

[Survived] LogicalOperator
hooks/trident-hooks.ts:107:9
   var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
 
   if (eventType === 'session.created' || eventType === 'session.updated') {
-    if (agent && isTridentAgent(agent)) {
+    if (agent || isTridentAgent(agent)) {
       setCurrentAgent(agent);
       orchestrator.setSession(sessionId);

[Survived] ConditionalExpression
hooks/trident-hooks.ts:107:9
   var sessionId = rawEvent.sessionId as string || rawEvent.sessionID as string || '';
 
   if (eventType === 'session.created' || eventType === 'session.updated') {
-    if (agent && isTridentAgent(agent)) {
+    if (false) {
       setCurrentAgent(agent);
       orchestrator.setSession(sessionId);

[Survived] BlockStatement
hooks/trident-hooks.ts:110:12
     if (agent && isTridentAgent(agent)) {
       setCurrentAgent(agent);
       orchestrator.setSession(sessionId);
-    } else {
-      clearCurrentAgent();
-      orchestrator.resetSession();
-    }
+    } else {}
   } else if (eventType === 'session.ended') {
     clearCurrentAgent();

[Survived] BlockStatement
hooks/trident-hooks.ts:114:45
       clearCurrentAgent();
       orchestrator.resetSession();
     }
-  } else if (eventType === 'session.ended') {
-    clearCurrentAgent();
-    orchestrator.resetSession();
-  }
+  } else if (eventType === 'session.ended') {}
 };
 

[Survived] EqualityOperator
hooks/trident-hooks.ts:114:14
       clearCurrentAgent();
       orchestrator.resetSession();
     }
-  } else if (eventType === 'session.ended') {
+  } else if (eventType !== 'session.ended') {
     clearCurrentAgent();
     orchestrator.resetSession();

[Survived] ConditionalExpression
hooks/trident-hooks.ts:121:15
 };
 
 var chatMessageHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
-  var agent = (input && (input.agentName as string || input.agent as string)) || getCurrentAgent() || '';
+  var agent = false || '';
   if (isTridentAgent(agent)) {
     setCurrentAgent(agent);

[Survived] ConditionalExpression
hooks/trident-hooks.ts:121:15
 };
 
 var chatMessageHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
-  var agent = (input && (input.agentName as string || input.agent as string)) || getCurrentAgent() || '';
+  var agent = false;
   if (isTridentAgent(agent)) {
     setCurrentAgent(agent);

[Survived] BlockStatement
hooks/trident-hooks.ts:122:30
 
 var chatMessageHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
   var agent = (input && (input.agentName as string || input.agent as string)) || getCurrentAgent() || '';
-  if (isTridentAgent(agent)) {
-    setCurrentAgent(agent);
-  }
+  if (isTridentAgent(agent)) {}
   if (!isTridentAgent(agent)) return;
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:122:7
 
 var chatMessageHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
   var agent = (input && (input.agentName as string || input.agent as string)) || getCurrentAgent() || '';
-  if (isTridentAgent(agent)) {
+  if (true) {
     setCurrentAgent(agent);
   }

[Survived] ConditionalExpression
hooks/trident-hooks.ts:125:7
   if (isTridentAgent(agent)) {
     setCurrentAgent(agent);
   }
-  if (!isTridentAgent(agent)) return;
+  if (true) return;
 
   // Determine if this is a user message or model response by checking the message role.

[Survived] ConditionalExpression
hooks/trident-hooks.ts:125:7
   if (isTridentAgent(agent)) {
     setCurrentAgent(agent);
   }
-  if (!isTridentAgent(agent)) return;
+  if (false) return;
 
   // Determine if this is a user message or model response by checking the message role.

[Survived] ConditionalExpression
hooks/trident-hooks.ts:133:17
   // NOT to user input (which would cause false positives on user phrases like
   // "Let me" or "I would").
   var outputText = extractOutputText(output);
-  var msgRole = ((output?.message as Record<string, unknown>)?.role as string) || '';
+  var msgRole = true;
   var isUserInput = msgRole === 'user';
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:133:17
   // NOT to user input (which would cause false positives on user phrases like
   // "Let me" or "I would").
   var outputText = extractOutputText(output);
-  var msgRole = ((output?.message as Record<string, unknown>)?.role as string) || '';
+  var msgRole = false;
   var isUserInput = msgRole === 'user';
 

[Survived] EqualityOperator
hooks/trident-hooks.ts:134:21
   // "Let me" or "I would").
   var outputText = extractOutputText(output);
   var msgRole = ((output?.message as Record<string, unknown>)?.role as string) || '';
-  var isUserInput = msgRole === 'user';
+  var isUserInput = msgRole !== 'user';
 
   // F1 FIX: On every new user message, reset tool call tracking.

[Survived] ConditionalExpression
hooks/trident-hooks.ts:134:21
   // "Let me" or "I would").
   var outputText = extractOutputText(output);
   var msgRole = ((output?.message as Record<string, unknown>)?.role as string) || '';
-  var isUserInput = msgRole === 'user';
+  var isUserInput = false;
 
   // F1 FIX: On every new user message, reset tool call tracking.

[Survived] BlockStatement
hooks/trident-hooks.ts:140:20
   // Without this, toolsCalledThisTurn accumulates across turns and causes
   // the narration check to be skipped on subsequent turns even when no
   // tool was called in that turn.
-  if (isUserInput) {
-    toolsCalledThisTurn = 0;
-    // Don't apply narration detection to user input — only to model responses
-    if (outputText) {
-      const { detectIntent } = await import("../nlp/intent-parser.js");
-      const intent = detectIntent(outputText);
-      orchestrator.detectAndSwitch(outputText);
-    }
-    return;
-  }
+  if (isUserInput) {}
 
   // From here: this is a model response (assistant role). Apply narration detection.

[Survived] ConditionalExpression
hooks/trident-hooks.ts:140:7
   // Without this, toolsCalledThisTurn accumulates across turns and causes
   // the narration check to be skipped on subsequent turns even when no
   // tool was called in that turn.
-  if (isUserInput) {
+  if (false) {
     toolsCalledThisTurn = 0;
     // Don't apply narration detection to user input — only to model responses

[Survived] BlockStatement
hooks/trident-hooks.ts:143:21
   if (isUserInput) {
     toolsCalledThisTurn = 0;
     // Don't apply narration detection to user input — only to model responses
-    if (outputText) {
-      const { detectIntent } = await import("../nlp/intent-parser.js");
-      const intent = detectIntent(outputText);
-      orchestrator.detectAndSwitch(outputText);
-    }
+    if (outputText) {}
     return;
   }

[Survived] ConditionalExpression
hooks/trident-hooks.ts:143:9
   if (isUserInput) {
     toolsCalledThisTurn = 0;
     // Don't apply narration detection to user input — only to model responses
-    if (outputText) {
+    if (true) {
       const { detectIntent } = await import("../nlp/intent-parser.js");
       const intent = detectIntent(outputText);

[Survived] ConditionalExpression
hooks/trident-hooks.ts:152:23
   }
 
   // From here: this is a model response (assistant role). Apply narration detection.
-  var hasCalledTool = toolsCalledThisTurn > 0;
+  var hasCalledTool = true;
 
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──

[Survived] EqualityOperator
hooks/trident-hooks.ts:152:23
   }
 
   // From here: this is a model response (assistant role). Apply narration detection.
-  var hasCalledTool = toolsCalledThisTurn > 0;
+  var hasCalledTool = toolsCalledThisTurn <= 0;
 
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──

[Survived] ConditionalExpression
hooks/trident-hooks.ts:155:7
   var hasCalledTool = toolsCalledThisTurn > 0;
 
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──
-  if (!hasCalledTool) {
+  if (true) {
     for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {

[Survived] ConditionalExpression
hooks/trident-hooks.ts:155:7
   var hasCalledTool = toolsCalledThisTurn > 0;
 
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──
-  if (!hasCalledTool) {
+  if (false) {
     for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {

[Survived] EqualityOperator
hooks/trident-hooks.ts:156:22
 
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──
   if (!hasCalledTool) {
-    for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
+    for (var pi = 0; pi <= PRE_TOOL_NARRATION.length; pi++) {
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
         output.error = true;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:156:22
 
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──
   if (!hasCalledTool) {
-    for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
+    for (var pi = 0; false; pi++) {
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
         output.error = true;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:157:11
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──
   if (!hasCalledTool) {
     for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
-      if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
+      if (true) {
         output.error = true;
         (output as any).isError = true;

[Survived] BlockStatement
hooks/trident-hooks.ts:157:58
   // ── BLOCK 1: Pre-tool narration (describing instead of executing) ──
   if (!hasCalledTool) {
     for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
-      if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
-        output.error = true;
-        (output as any).isError = true;
-        output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
-        orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText.substring(0, 200));
-        return;
-      }
+      if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {}
     }
   }

[Survived] BooleanLiteral
hooks/trident-hooks.ts:158:24
   if (!hasCalledTool) {
     for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
-        output.error = true;
+        output.error = false;
         (output as any).isError = true;
         output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };

[Survived] BooleanLiteral
hooks/trident-hooks.ts:159:35
     for (var pi = 0; pi < PRE_TOOL_NARRATION.length; pi++) {
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
         output.error = true;
-        (output as any).isError = true;
+        (output as any).isError = false;
         output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
         orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText.substring(0, 200));
