[Survived] ObjectLiteral
hooks/trident-hooks.ts:160:26
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
         output.error = true;
         (output as any).isError = true;
-        output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
+        output.message = {};
         orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText.substring(0, 200));
         return;

[Survived] StringLiteral
hooks/trident-hooks.ts:160:34
       if (PRE_TOOL_NARRATION[pi].regex.test(outputText)) {
         output.error = true;
         (output as any).isError = true;
-        output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
+        output.message = { role: "", content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
         orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText.substring(0, 200));
         return;

[Survived] MethodExpression
hooks/trident-hooks.ts:161:106
         output.error = true;
         (output as any).isError = true;
         output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
-        orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText.substring(0, 200));
+        orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText);
         return;
       }

[Survived] StringLiteral
hooks/trident-hooks.ts:161:88
         output.error = true;
         (output as any).isError = true;
         output.message = { role: 'system', content: buildNarrationRejection(PRE_TOOL_NARRATION[pi].label) };
-        orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + ':' + Date.now(), outputText.substring(0, 200));
+        orchestrator.addArtifact('narration_blocked:' + PRE_TOOL_NARRATION[pi].label + "" + Date.now(), outputText.substring(0, 200));
         return;
       }

[Survived] BlockStatement
hooks/trident-hooks.ts:168:23
   }
 
   // ── BLOCK 2: Phantom results (reporting findings without running the tool) ──
-  if (!hasCalledTool) {
-    for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
-      if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {
-        output.error = true;
-        (output as any).isError = true;
-        output.message = { role: 'system', content: buildPhantomRejection(PHANTOM_RESULTS[pi2].label) };
-        orchestrator.addArtifact('phantom_blocked:' + PHANTOM_RESULTS[pi2].label + ':' + Date.now(), outputText.substring(0, 200));
-        return;
-      }
-    }
-  }
+  if (!hasCalledTool) {}
 
   // Track last model message for Phase 5 (narration mismatch detection in tool.before)

[Survived] ConditionalExpression
hooks/trident-hooks.ts:168:7
   }
 
   // ── BLOCK 2: Phantom results (reporting findings without running the tool) ──
-  if (!hasCalledTool) {
+  if (true) {
     for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
       if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {

[Survived] EqualityOperator
hooks/trident-hooks.ts:169:23
 
   // ── BLOCK 2: Phantom results (reporting findings without running the tool) ──
   if (!hasCalledTool) {
-    for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
+    for (var pi2 = 0; pi2 >= PHANTOM_RESULTS.length; pi2++) {
       if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {
         output.error = true;

[Survived] BlockStatement
hooks/trident-hooks.ts:169:60
 
   // ── BLOCK 2: Phantom results (reporting findings without running the tool) ──
   if (!hasCalledTool) {
-    for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
-      if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {
-        output.error = true;
-        (output as any).isError = true;
-        output.message = { role: 'system', content: buildPhantomRejection(PHANTOM_RESULTS[pi2].label) };
-        orchestrator.addArtifact('phantom_blocked:' + PHANTOM_RESULTS[pi2].label + ':' + Date.now(), outputText.substring(0, 200));
-        return;
-      }
-    }
+    for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {}
   }
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:170:11
   // ── BLOCK 2: Phantom results (reporting findings without running the tool) ──
   if (!hasCalledTool) {
     for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
-      if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {
+      if (true) {
         output.error = true;
         (output as any).isError = true;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:170:11
   // ── BLOCK 2: Phantom results (reporting findings without running the tool) ──
   if (!hasCalledTool) {
     for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
-      if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {
+      if (false) {
         output.error = true;
         (output as any).isError = true;

[Survived] BooleanLiteral
hooks/trident-hooks.ts:171:24
   if (!hasCalledTool) {
     for (var pi2 = 0; pi2 < PHANTOM_RESULTS.length; pi2++) {
       if (PHANTOM_RESULTS[pi2].regex.test(outputText)) {
-        output.error = true;
+        output.error = false;
         (output as any).isError = true;
         output.message = { role: 'system', content: buildPhantomRejection(PHANTOM_RESULTS[pi2].label) };

[Survived] MethodExpression
hooks/trident-hooks.ts:174:102
         output.error = true;
         (output as any).isError = true;
         output.message = { role: 'system', content: buildPhantomRejection(PHANTOM_RESULTS[pi2].label) };
-        orchestrator.addArtifact('phantom_blocked:' + PHANTOM_RESULTS[pi2].label + ':' + Date.now(), outputText.substring(0, 200));
+        orchestrator.addArtifact('phantom_blocked:' + PHANTOM_RESULTS[pi2].label + ':' + Date.now(), outputText);
         return;
       }

[Survived] EqualityOperator
hooks/trident-hooks.ts:181:7
   }
 
   // Track last model message for Phase 5 (narration mismatch detection in tool.before)
-  if (msgRole === 'assistant') {
+  if (msgRole !== 'assistant') {
     lastModelMessage = outputText;
   }

[Survived] BlockStatement
hooks/trident-hooks.ts:181:32
   }
 
   // Track last model message for Phase 5 (narration mismatch detection in tool.before)
-  if (msgRole === 'assistant') {
-    lastModelMessage = outputText;
-  }
+  if (msgRole === 'assistant') {}
 
   // If tool was called, analysis is valid. Tool tracking resets on next user message.

[Survived] ConditionalExpression
hooks/trident-hooks.ts:192:22
   // Use input.session.agentName FIRST (authoritative per OpenCode API),
   // fall back to global state. This ensures correct agent identity
   // even when other plugins fire the hook simultaneously.
-  var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
+  var sessionAgent = false;
   var globalAgent = getCurrentAgent() || '';
   var agentName = sessionAgent || globalAgent;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:192:22
   // Use input.session.agentName FIRST (authoritative per OpenCode API),
   // fall back to global state. This ensures correct agent identity
   // even when other plugins fire the hook simultaneously.
-  var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
+  var sessionAgent = true;
   var globalAgent = getCurrentAgent() || '';
   var agentName = sessionAgent || globalAgent;

[Survived] LogicalOperator
hooks/trident-hooks.ts:193:21
   // fall back to global state. This ensures correct agent identity
   // even when other plugins fire the hook simultaneously.
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
-  var globalAgent = getCurrentAgent() || '';
+  var globalAgent = getCurrentAgent() && '';
   var agentName = sessionAgent || globalAgent;
   if (!isTridentAgent(agentName)) return;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:193:21
   // fall back to global state. This ensures correct agent identity
   // even when other plugins fire the hook simultaneously.
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
-  var globalAgent = getCurrentAgent() || '';
+  var globalAgent = false;
   var agentName = sessionAgent || globalAgent;
   if (!isTridentAgent(agentName)) return;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:194:19
   // even when other plugins fire the hook simultaneously.
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
   var globalAgent = getCurrentAgent() || '';
-  var agentName = sessionAgent || globalAgent;
+  var agentName = true;
   if (!isTridentAgent(agentName)) return;
 

[Timeout] ConditionalExpression
hooks/trident-hooks.ts:194:19
   // even when other plugins fire the hook simultaneously.
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
   var globalAgent = getCurrentAgent() || '';
-  var agentName = sessionAgent || globalAgent;
+  var agentName = false;
   if (!isTridentAgent(agentName)) return;
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:195:7
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
   var globalAgent = getCurrentAgent() || '';
   var agentName = sessionAgent || globalAgent;
-  if (!isTridentAgent(agentName)) return;
+  if (true) return;
 
   var toolName = input && input.tool as string || '';

[Survived] ConditionalExpression
hooks/trident-hooks.ts:195:7
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
   var globalAgent = getCurrentAgent() || '';
   var agentName = sessionAgent || globalAgent;
-  if (!isTridentAgent(agentName)) return;
+  if (false) return;
 
   var toolName = input && input.tool as string || '';

[Survived] LogicalOperator
hooks/trident-hooks.ts:197:18
   var agentName = sessionAgent || globalAgent;
   if (!isTridentAgent(agentName)) return;
 
-  var toolName = input && input.tool as string || '';
+  var toolName = input || input.tool as string || '';
   try {
     if (toolName && !isToolAllowedAllowlist(toolName)) {

[Survived] ConditionalExpression
hooks/trident-hooks.ts:197:18
   var agentName = sessionAgent || globalAgent;
   if (!isTridentAgent(agentName)) return;
 
-  var toolName = input && input.tool as string || '';
+  var toolName = false;
   try {
     if (toolName && !isToolAllowedAllowlist(toolName)) {

[Survived] BlockStatement
hooks/trident-hooks.ts:199:56
 
   var toolName = input && input.tool as string || '';
   try {
-    if (toolName && !isToolAllowedAllowlist(toolName)) {
-      throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: ' + toolName + ' - Deny-default allowlist.');
-    }
+    if (toolName && !isToolAllowedAllowlist(toolName)) {}
     if (toolName === 'task') {
       throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: task - Trident is an audit engine.');

[Survived] ConditionalExpression
hooks/trident-hooks.ts:199:9
 
   var toolName = input && input.tool as string || '';
   try {
-    if (toolName && !isToolAllowedAllowlist(toolName)) {
+    if (false) {
       throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: ' + toolName + ' - Deny-default allowlist.');
     }

[Survived] ConditionalExpression
hooks/trident-hooks.ts:202:9
     if (toolName && !isToolAllowedAllowlist(toolName)) {
       throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: ' + toolName + ' - Deny-default allowlist.');
     }
-    if (toolName === 'task') {
+    if (false) {
       throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: task - Trident is an audit engine.');
     }

[Survived] BlockStatement
hooks/trident-hooks.ts:202:30
     if (toolName && !isToolAllowedAllowlist(toolName)) {
       throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: ' + toolName + ' - Deny-default allowlist.');
     }
-    if (toolName === 'task') {
-      throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: task - Trident is an audit engine.');
-    }
+    if (toolName === 'task') {}
     
     // ── PHASE 5: NARRATION MISMATCH DETECTION ──

[Survived] StringLiteral
hooks/trident-hooks.ts:203:23
       throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: ' + toolName + ' - Deny-default allowlist.');
     }
     if (toolName === 'task') {
-      throw new Error('[TRIDENT TOOL BLOCK] TOOL_BLOCKED: task - Trident is an audit engine.');
+      throw new Error("");
     }
     

[Survived] ConditionalExpression
hooks/trident-hooks.ts:210:9
     // If model said "I would use X" in its last message but is now calling tool Y,
     // that's a narration mismatch — the model is describing what it would do
     // instead of just executing.
-    if (lastModelMessage) {
+    if (true) {
       var narrationPatterns = [
         /i would (use|call|invoke|run)\s+\S+/i,

[Survived] BlockStatement
hooks/trident-hooks.ts:210:27
     // If model said "I would use X" in its last message but is now calling tool Y,
     // that's a narration mismatch — the model is describing what it would do
     // instead of just executing.
-    if (lastModelMessage) {
-      var narrationPatterns = [
-        /i would (use|call|invoke|run)\s+\S+/i,
-        /let me (use|call|invoke|run|try)\s+\S+/i,
-        /first,?\s+(i will|i'll|i should)\s+\S+/i,
-        /one approach would be/i,
-        /the best (way|approach) is/i,
-        /what i would do is/i,
-      ];
-      var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(lastModelMessage || ''); });
-      var mentionedTool = lastModelMessage.match(/(trident-[a-z-]+|write|edit|bash)\b/i);
-      if (isNarration && mentionedTool && mentionedTool[1] !== toolName) {
-        throw new Error('TOOL EXECUTION REQUIRED: Call the tool directly');
-      }
-    }
+    if (lastModelMessage) {}
     
     if (toolName && toolName.indexOf('trident-') === 0) {

[Survived] Regex
hooks/trident-hooks.ts:212:9
     // instead of just executing.
     if (lastModelMessage) {
       var narrationPatterns = [
-        /i would (use|call|invoke|run)\s+\S+/i,
+        /i would (use|call|invoke|run)\s\S+/i,
         /let me (use|call|invoke|run|try)\s+\S+/i,
         /first,?\s+(i will|i'll|i should)\s+\S+/i,

[Survived] Regex
hooks/trident-hooks.ts:212:9
     // instead of just executing.
     if (lastModelMessage) {
       var narrationPatterns = [
-        /i would (use|call|invoke|run)\s+\S+/i,
+        /i would (use|call|invoke|run)\s+\s+/i,
         /let me (use|call|invoke|run|try)\s+\S+/i,
         /first,?\s+(i will|i'll|i should)\s+\S+/i,

[Survived] Regex
hooks/trident-hooks.ts:213:9
     if (lastModelMessage) {
       var narrationPatterns = [
         /i would (use|call|invoke|run)\s+\S+/i,
-        /let me (use|call|invoke|run|try)\s+\S+/i,
+        /let me (use|call|invoke|run|try)\s+\S/i,
         /first,?\s+(i will|i'll|i should)\s+\S+/i,
         /one approach would be/i,

[Survived] Regex
hooks/trident-hooks.ts:214:9
       var narrationPatterns = [
         /i would (use|call|invoke|run)\s+\S+/i,
         /let me (use|call|invoke|run|try)\s+\S+/i,
-        /first,?\s+(i will|i'll|i should)\s+\S+/i,
+        /first,?\s+(i will|i'll|i should)\s+\s+/i,
         /one approach would be/i,
         /the best (way|approach) is/i,

[Survived] Regex
hooks/trident-hooks.ts:214:9
       var narrationPatterns = [
         /i would (use|call|invoke|run)\s+\S+/i,
         /let me (use|call|invoke|run|try)\s+\S+/i,
-        /first,?\s+(i will|i'll|i should)\s+\S+/i,
+        /first,?\s+(i will|i'll|i should)\S+\S+/i,
         /one approach would be/i,
         /the best (way|approach) is/i,

[Survived] ConditionalExpression
hooks/trident-hooks.ts:219:84
         /the best (way|approach) is/i,
         /what i would do is/i,
       ];
-      var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(lastModelMessage || ''); });
+      var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(true); });
       var mentionedTool = lastModelMessage.match(/(trident-[a-z-]+|write|edit|bash)\b/i);
       if (isNarration && mentionedTool && mentionedTool[1] !== toolName) {

[Survived] BlockStatement
hooks/trident-hooks.ts:219:68
         /the best (way|approach) is/i,
         /what i would do is/i,
       ];
-      var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(lastModelMessage || ''); });
+      var isNarration = narrationPatterns.some(function(p: RegExp) {});
       var mentionedTool = lastModelMessage.match(/(trident-[a-z-]+|write|edit|bash)\b/i);
       if (isNarration && mentionedTool && mentionedTool[1] !== toolName) {

[Survived] Regex
hooks/trident-hooks.ts:220:50
         /what i would do is/i,
       ];
       var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(lastModelMessage || ''); });
-      var mentionedTool = lastModelMessage.match(/(trident-[a-z-]+|write|edit|bash)\b/i);
+      var mentionedTool = lastModelMessage.match(/(trident-[^a-z-]+|write|edit|bash)\b/i);
       if (isNarration && mentionedTool && mentionedTool[1] !== toolName) {
         throw new Error('TOOL EXECUTION REQUIRED: Call the tool directly');

[Survived] ConditionalExpression
hooks/trident-hooks.ts:221:11
       ];
       var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(lastModelMessage || ''); });
       var mentionedTool = lastModelMessage.match(/(trident-[a-z-]+|write|edit|bash)\b/i);
-      if (isNarration && mentionedTool && mentionedTool[1] !== toolName) {
+      if (false) {
         throw new Error('TOOL EXECUTION REQUIRED: Call the tool directly');
       }

[Survived] EqualityOperator
hooks/trident-hooks.ts:221:43
       ];
       var isNarration = narrationPatterns.some(function(p: RegExp) { return p.test(lastModelMessage || ''); });
       var mentionedTool = lastModelMessage.match(/(trident-[a-z-]+|write|edit|bash)\b/i);
-      if (isNarration && mentionedTool && mentionedTool[1] !== toolName) {
+      if (isNarration && mentionedTool && mentionedTool[1] === toolName) {
         throw new Error('TOOL EXECUTION REQUIRED: Call the tool directly');
       }

[Survived] ConditionalExpression
hooks/trident-hooks.ts:226:9
       }
     }
     
-    if (toolName && toolName.indexOf('trident-') === 0) {
+    if (false) {
       orchestrator.addArtifact('tool_before:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
       toolsCalledThisTurn++; // Track tool call

[Survived] LogicalOperator
hooks/trident-hooks.ts:226:9
       }
     }
     
-    if (toolName && toolName.indexOf('trident-') === 0) {
+    if (toolName || toolName.indexOf('trident-') === 0) {
       orchestrator.addArtifact('tool_before:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
       toolsCalledThisTurn++; // Track tool call

[Survived] StringLiteral
hooks/trident-hooks.ts:227:32
     }
     
     if (toolName && toolName.indexOf('trident-') === 0) {
-      orchestrator.addArtifact('tool_before:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
+      orchestrator.addArtifact("" + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
       toolsCalledThisTurn++; // Track tool call
     }

[Survived] UpdateOperator
hooks/trident-hooks.ts:228:7
     
     if (toolName && toolName.indexOf('trident-') === 0) {
       orchestrator.addArtifact('tool_before:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
-      toolsCalledThisTurn++; // Track tool call
+      toolsCalledThisTurn--; // Track tool call
     }
   } finally {}

[Survived] BlockStatement
hooks/trident-hooks.ts:233:101
   } finally {}
 };
 
-var toolAfterHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
-  var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
-  var globalAgent = getCurrentAgent() || '';
-  var agentName = sessionAgent || globalAgent;
-  if (!isTridentAgent(agentName)) return;
-
-  var toolName = input && input.tool as string || '';
-  if (toolName && toolName.indexOf('trident-') === 0) {
-    orchestrator.addArtifact('tool_after:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
-  }
-};
+var toolAfterHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {};
 
 var systemTransformHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {

[Survived] LogicalOperator
hooks/trident-hooks.ts:234:22
 };
 
 var toolAfterHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
-  var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
+  var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string && '';
   var globalAgent = getCurrentAgent() || '';
   var agentName = sessionAgent || globalAgent;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:234:22
 };
 
 var toolAfterHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
-  var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
+  var sessionAgent = true;
   var globalAgent = getCurrentAgent() || '';
   var agentName = sessionAgent || globalAgent;

[Survived] ConditionalExpression
hooks/trident-hooks.ts:235:21
 
 var toolAfterHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
-  var globalAgent = getCurrentAgent() || '';
+  var globalAgent = true;
   var agentName = sessionAgent || globalAgent;
   if (!isTridentAgent(agentName)) return;

[Survived] LogicalOperator
hooks/trident-hooks.ts:236:19
 var toolAfterHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
   var sessionAgent = (input?.session as Record<string, unknown>)?.agentName as string || '';
   var globalAgent = getCurrentAgent() || '';
-  var agentName = sessionAgent || globalAgent;
+  var agentName = sessionAgent && globalAgent;
   if (!isTridentAgent(agentName)) return;
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:239:18
   var agentName = sessionAgent || globalAgent;
   if (!isTridentAgent(agentName)) return;
 
-  var toolName = input && input.tool as string || '';
+  var toolName = true;
   if (toolName && toolName.indexOf('trident-') === 0) {
     orchestrator.addArtifact('tool_after:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));

[Survived] BlockStatement
hooks/trident-hooks.ts:240:55
   if (!isTridentAgent(agentName)) return;
 
   var toolName = input && input.tool as string || '';
-  if (toolName && toolName.indexOf('trident-') === 0) {
-    orchestrator.addArtifact('tool_after:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
-  }
+  if (toolName && toolName.indexOf('trident-') === 0) {}
 };
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:240:19
   if (!isTridentAgent(agentName)) return;
 
   var toolName = input && input.tool as string || '';
-  if (toolName && toolName.indexOf('trident-') === 0) {
+  if (toolName && true) {
     orchestrator.addArtifact('tool_after:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
   }

[Survived] StringLiteral
hooks/trident-hooks.ts:241:57
 
   var toolName = input && input.tool as string || '';
   if (toolName && toolName.indexOf('trident-') === 0) {
-    orchestrator.addArtifact('tool_after:' + toolName + ':' + Date.now(), JSON.stringify({ tool: toolName }));
+    orchestrator.addArtifact('tool_after:' + toolName + "" + Date.now(), JSON.stringify({ tool: toolName }));
   }
 };

[Survived] BooleanLiteral
hooks/trident-hooks.ts:247:21
 
 var systemTransformHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
   var systemOut = output as { system?: string[] };
-  if (!systemOut || !Array.isArray(systemOut.system)) return;
+  if (!systemOut || Array.isArray(systemOut.system)) return;
 
   // IMPORTANT: No agent check here.

[Survived] LogicalOperator
hooks/trident-hooks.ts:247:7
 
 var systemTransformHook = async function(input: Record<string, unknown>, output: Record<string, unknown>) {
   var systemOut = output as { system?: string[] };
-  if (!systemOut || !Array.isArray(systemOut.system)) return;
+  if (!systemOut && !Array.isArray(systemOut.system)) return;
 
   // IMPORTANT: No agent check here.

[Survived] MethodExpression
hooks/trident-hooks.ts:258:25
   // We must ALWAYS inject identity to override other plugins' identity headers.
   // On subsequent calls (agent switches), the dedup check prevents double injection.
 
-  var alreadyInjected = systemOut.system.some(function(s: string) {
-    return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
-  });
+  var alreadyInjected = systemOut.system.every(function (s: string) {
+  return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
+});
 
   if (!alreadyInjected) {

[Survived] BlockStatement
hooks/trident-hooks.ts:258:67
   // We must ALWAYS inject identity to override other plugins' identity headers.
   // On subsequent calls (agent switches), the dedup check prevents double injection.
 
-  var alreadyInjected = systemOut.system.some(function(s: string) {
-    return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
-  });
+  var alreadyInjected = systemOut.system.some(function(s: string) {});
 
   if (!alreadyInjected) {

[Survived] ConditionalExpression
hooks/trident-hooks.ts:259:12
   // On subsequent calls (agent switches), the dedup check prevents double injection.
 
   var alreadyInjected = systemOut.system.some(function(s: string) {
-    return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
+    return false;
   });
 

[Survived] EqualityOperator
hooks/trident-hooks.ts:259:12
   // On subsequent calls (agent switches), the dedup check prevents double injection.
 
   var alreadyInjected = systemOut.system.some(function(s: string) {
-    return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
+    return typeof s !== 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
   });
 

[Survived] BlockStatement
hooks/trident-hooks.ts:262:25
     return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
   });
 
-  if (!alreadyInjected) {
-    // CRITICAL: In multi-plugin environments, Manta, Kraken etc. inject their OWN
-    // identity headers into the system prompt. The framework may merge ALL plugins'
-    // system.transform outputs into one array. The model sees EVERY identity and
-    // follows the wrong one. Clear everything and ONLY put Trident identity.
-    systemOut.system = [TRIDENT_IDENTITY_HEADER];
-  }
+  if (!alreadyInjected) {}
 
   var state = orchestrator.getState();

[Survived] ConditionalExpression
hooks/trident-hooks.ts:262:7
     return typeof s === 'string' && s.indexOf('TRIDENT IDENTITY BINDING') !== -1;
   });
 
-  if (!alreadyInjected) {
+  if (true) {
     // CRITICAL: In multi-plugin environments, Manta, Kraken etc. inject their OWN
     // identity headers into the system prompt. The framework may merge ALL plugins'

[Survived] ArrayDeclaration
hooks/trident-hooks.ts:267:24
     // identity headers into the system prompt. The framework may merge ALL plugins'
     // system.transform outputs into one array. The model sees EVERY identity and
     // follows the wrong one. Clear everything and ONLY put Trident identity.
-    systemOut.system = [TRIDENT_IDENTITY_HEADER];
+    systemOut.system = [];
   }
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:272:18
 
   var state = orchestrator.getState();
   var maxLayers = orchestrator.getMaxLayers();
-  var varAgent = getCurrentAgent() || 'trident';
+  var varAgent = true;
   var contextLines = [
     '[TRIDENT v4.3] Agent: ' + varAgent + ' | Mode: ' + state.mode + ' | Layer: ' + state.currentLayer + '/' + maxLayers + ' | Status: ' + state.status,

[Survived] ConditionalExpression
hooks/trident-hooks.ts:272:18
 
   var state = orchestrator.getState();
   var maxLayers = orchestrator.getMaxLayers();
-  var varAgent = getCurrentAgent() || 'trident';
+  var varAgent = false;
   var contextLines = [
     '[TRIDENT v4.3] Agent: ' + varAgent + ' | Mode: ' + state.mode + ' | Layer: ' + state.currentLayer + '/' + maxLayers + ' | Status: ' + state.status,

[Survived] StringLiteral
hooks/trident-hooks.ts:275:5
   var varAgent = getCurrentAgent() || 'trident';
   var contextLines = [
     '[TRIDENT v4.3] Agent: ' + varAgent + ' | Mode: ' + state.mode + ' | Layer: ' + state.currentLayer + '/' + maxLayers + ' | Status: ' + state.status,
-    '[TRIDENT v4.3] CORE PRINCIPLE: "Trident Audits & Generates Review Artifacts. Build Agents Implement All Changes."',
+    "",
     '[TRIDENT v4.3] TOOLS: trident-code-audit (17-layer), trident-deep-planning, trident-problem-solving, trident-context-synthesis, trident-gate, trident-status, trident-vision, trident-help.',
   ];

[Survived] BooleanLiteral
hooks/trident-hooks.ts:280:7
   ];
   systemOut.system.push(contextLines.join('\n'));
 
-  if (!state.identityLoaded) {
+  if (state.identityLoaded) {
     orchestrator.setIdentityLoaded(true);
   }

[Survived] BlockStatement
hooks/trident-hooks.ts:280:30
   ];
   systemOut.system.push(contextLines.join('\n'));
 
-  if (!state.identityLoaded) {
-    orchestrator.setIdentityLoaded(true);
-  }
+  if (!state.identityLoaded) {}
 };
 

[Survived] BooleanLiteral
hooks/trident-hooks.ts:281:36
   systemOut.system.push(contextLines.join('\n'));
 
   if (!state.identityLoaded) {
-    orchestrator.setIdentityLoaded(true);
+    orchestrator.setIdentityLoaded(false);
   }
 };
