[Survived] BlockStatement
hooks/trident-hooks.ts:295:7
   input: Record<string, unknown>,
   output: Record<string, unknown>
 ) {
-  try {
-    var msgs = (output as any)?.messages as Array<Record<string, unknown>> | undefined;
-    if (!msgs || !Array.isArray(msgs) || msgs.length === 0) return;
-
-    // Access the first message's info (Message object)
-    var firstMsg = msgs[0] as Record<string, unknown>;
-    var firstInfo = firstMsg?.info as Record<string, unknown> | undefined;
-
-    // If no info object, inject as first message with system role
-    if (!firstInfo) {
-      firstMsg.info = { role: 'system' };
-      firstMsg.parts = [{ type: 'text', text: TRIDENT_IDENTITY_HEADER }];
-      return;
-    }
-
-    // UserMessage has a 'system' field that overrides the global system prompt
-    // Check if it already has Trident identity
-    var currentSystem = (firstInfo.system as string) || '';
-    if (currentSystem.indexOf('TRIDENT v4.3 IDENTITY BINDING') !== -1) return;
-
-    // Prepend Trident identity to the per-message system prompt
-    // This puts Trident identity into the model's context BEFORE every inference
-    firstInfo.system = TRIDENT_IDENTITY_HEADER + '\n\n' + currentSystem;
-  } catch (_e) {
+  try {} catch (_e) {
     // NEVER crash the message pipeline
   }

[Survived] ConditionalExpression
hooks/trident-hooks.ts:297:9
 ) {
   try {
     var msgs = (output as any)?.messages as Array<Record<string, unknown>> | undefined;
-    if (!msgs || !Array.isArray(msgs) || msgs.length === 0) return;
+    if (false || msgs.length === 0) return;
 
     // Access the first message's info (Message object)

[Survived] ConditionalExpression
hooks/trident-hooks.ts:297:9
 ) {
   try {
     var msgs = (output as any)?.messages as Array<Record<string, unknown>> | undefined;
-    if (!msgs || !Array.isArray(msgs) || msgs.length === 0) return;
+    if (false) return;
 
     // Access the first message's info (Message object)

[Survived] ConditionalExpression
hooks/trident-hooks.ts:304:9
     var firstInfo = firstMsg?.info as Record<string, unknown> | undefined;
 
     // If no info object, inject as first message with system role
-    if (!firstInfo) {
+    if (true) {
       firstMsg.info = { role: 'system' };
       firstMsg.parts = [{ type: 'text', text: TRIDENT_IDENTITY_HEADER }];

[Survived] BooleanLiteral
hooks/trident-hooks.ts:304:9
     var firstInfo = firstMsg?.info as Record<string, unknown> | undefined;
 
     // If no info object, inject as first message with system role
-    if (!firstInfo) {
+    if (firstInfo) {
       firstMsg.info = { role: 'system' };
       firstMsg.parts = [{ type: 'text', text: TRIDENT_IDENTITY_HEADER }];

[Survived] LogicalOperator
hooks/trident-hooks.ts:312:25
 
     // UserMessage has a 'system' field that overrides the global system prompt
     // Check if it already has Trident identity
-    var currentSystem = (firstInfo.system as string) || '';
+    var currentSystem = firstInfo.system as string && '';
     if (currentSystem.indexOf('TRIDENT v4.3 IDENTITY BINDING') !== -1) return;
 

[Survived] ConditionalExpression
hooks/trident-hooks.ts:312:25
 
     // UserMessage has a 'system' field that overrides the global system prompt
     // Check if it already has Trident identity
-    var currentSystem = (firstInfo.system as string) || '';
+    var currentSystem = true;
     if (currentSystem.indexOf('TRIDENT v4.3 IDENTITY BINDING') !== -1) return;
 

[Survived] EqualityOperator
hooks/trident-hooks.ts:313:9
     // UserMessage has a 'system' field that overrides the global system prompt
     // Check if it already has Trident identity
     var currentSystem = (firstInfo.system as string) || '';
-    if (currentSystem.indexOf('TRIDENT v4.3 IDENTITY BINDING') !== -1) return;
+    if (currentSystem.indexOf('TRIDENT v4.3 IDENTITY BINDING') === -1) return;
 
     // Prepend Trident identity to the per-message system prompt

[Survived] ConditionalExpression
hooks/trident-hooks.ts:313:9
     // UserMessage has a 'system' field that overrides the global system prompt
     // Check if it already has Trident identity
     var currentSystem = (firstInfo.system as string) || '';
-    if (currentSystem.indexOf('TRIDENT v4.3 IDENTITY BINDING') !== -1) return;
+    if (true) return;
 
     // Prepend Trident identity to the per-message system prompt

[Survived] StringLiteral
hooks/trident-hooks.ts:317:50
 
     // Prepend Trident identity to the per-message system prompt
     // This puts Trident identity into the model's context BEFORE every inference
-    firstInfo.system = TRIDENT_IDENTITY_HEADER + '\n\n' + currentSystem;
+    firstInfo.system = TRIDENT_IDENTITY_HEADER + "" + currentSystem;
   } catch (_e) {
     // NEVER crash the message pipeline

[Survived] BlockStatement
hooks/trident-hooks.ts:323:38
   }
 };
 
-export function createTridentHooks() {
-  return {
-    'event': eventHook,
-    'chat.message': chatMessageHook,
-    'tool.execute.before': toolBeforeHook,
-    'tool.execute.after': toolAfterHook,
-    'experimental.chat.system.transform': systemTransformHook,
-    'experimental.chat.messages.transform': messagesTransformHook,
-  };
-}
+export function createTridentHooks() {}
 
