[Survived] ObjectLiteral
orchestrator.ts:24:38
 }
 
 class Orchestrator {
-  private state: OrchestratorState = {
-    mode: 'IDLE',
-    currentLayer: 0,
-    maxLayers: 17,
-    iteration: 'V4.3.1',
-    status: 'IDLE',
-    initialized: true,
-    identityLoaded: true,
-    artifacts: new Map(),
-    lastIntent: null,
-  };
+  private state: OrchestratorState = {};
 
   private machineRef: any | null = null;

[Survived] StringLiteral
orchestrator.ts:29:13
     currentLayer: 0,
     maxLayers: 17,
     iteration: 'V4.3.1',
-    status: 'IDLE',
+    status: "",
     initialized: true,
     identityLoaded: true,

[Survived] BooleanLiteral
orchestrator.ts:30:18
     maxLayers: 17,
     iteration: 'V4.3.1',
     status: 'IDLE',
-    initialized: true,
+    initialized: false,
     identityLoaded: true,
     artifacts: new Map(),

[Survived] BooleanLiteral
orchestrator.ts:31:21
     iteration: 'V4.3.1',
     status: 'IDLE',
     initialized: true,
-    identityLoaded: true,
+    identityLoaded: false,
     artifacts: new Map(),
     lastIntent: null,

[Survived] BlockStatement
orchestrator.ts:38:17
 
   private machineRef: any | null = null;
 
-  constructor() {
-    // XState machine is loaded lazily via getOrchestratorMachine()
-    tridentLog('INFO', 'orchestrator', 'Orchestrator initialized (XState deferred)');
-  }
+  constructor() {}
 
   private async getOrchestratorMachine(): Promise<any> {

[Survived] StringLiteral
orchestrator.ts:40:16
 
   constructor() {
     // XState machine is loaded lazily via getOrchestratorMachine()
-    tridentLog('INFO', 'orchestrator', 'Orchestrator initialized (XState deferred)');
+    tridentLog("", 'orchestrator', 'Orchestrator initialized (XState deferred)');
   }
 

[Survived] BlockStatement
orchestrator.ts:43:56
     tridentLog('INFO', 'orchestrator', 'Orchestrator initialized (XState deferred)');
   }
 
-  private async getOrchestratorMachine(): Promise<any> {
-    try {
-      const { orchestratorMachine } = await import('./fsm/orchestrator-machine.js');
-      const { interpret } = await import('xstate');
-      if (!this.machineRef) {
-        this.machineRef = interpret(orchestratorMachine).start();
-      }
-      return this.machineRef;
-    } catch {
-      tridentLog('WARN', 'orchestrator', 'XState machine not available, using manual state');
-      return null;
-    }
-  }
+  private async getOrchestratorMachine(): Promise<any> {}
 
   startAudit(): void {

[Survived] BlockStatement
orchestrator.ts:44:9
   }
 
   private async getOrchestratorMachine(): Promise<any> {
-    try {
-      const { orchestratorMachine } = await import('./fsm/orchestrator-machine.js');
-      const { interpret } = await import('xstate');
-      if (!this.machineRef) {
-        this.machineRef = interpret(orchestratorMachine).start();
-      }
-      return this.machineRef;
-    } catch {
+    try {} catch {
       tridentLog('WARN', 'orchestrator', 'XState machine not available, using manual state');
       return null;

[Survived] StringLiteral
orchestrator.ts:45:52
 
   private async getOrchestratorMachine(): Promise<any> {
     try {
-      const { orchestratorMachine } = await import('./fsm/orchestrator-machine.js');
+      const { orchestratorMachine } = await import("");
       const { interpret } = await import('xstate');
       if (!this.machineRef) {

[Survived] StringLiteral
orchestrator.ts:46:42
   private async getOrchestratorMachine(): Promise<any> {
     try {
       const { orchestratorMachine } = await import('./fsm/orchestrator-machine.js');
-      const { interpret } = await import('xstate');
+      const { interpret } = await import("");
       if (!this.machineRef) {
         this.machineRef = interpret(orchestratorMachine).start();

[Survived] BlockStatement
orchestrator.ts:47:29
     try {
       const { orchestratorMachine } = await import('./fsm/orchestrator-machine.js');
       const { interpret } = await import('xstate');
-      if (!this.machineRef) {
-        this.machineRef = interpret(orchestratorMachine).start();
-      }
+      if (!this.machineRef) {}
       return this.machineRef;
     } catch {

[Survived] ConditionalExpression
orchestrator.ts:47:11
     try {
       const { orchestratorMachine } = await import('./fsm/orchestrator-machine.js');
       const { interpret } = await import('xstate');
-      if (!this.machineRef) {
+      if (false) {
         this.machineRef = interpret(orchestratorMachine).start();
       }

[Survived] BlockStatement
orchestrator.ts:51:13
         this.machineRef = interpret(orchestratorMachine).start();
       }
       return this.machineRef;
-    } catch {
-      tridentLog('WARN', 'orchestrator', 'XState machine not available, using manual state');
-      return null;
-    }
+    } catch {}
   }
 

[Survived] StringLiteral
orchestrator.ts:52:26
       }
       return this.machineRef;
     } catch {
-      tridentLog('WARN', 'orchestrator', 'XState machine not available, using manual state');
+      tridentLog('WARN', "", 'XState machine not available, using manual state');
       return null;
     }

[Survived] StringLiteral
orchestrator.ts:52:18
       }
       return this.machineRef;
     } catch {
-      tridentLog('WARN', 'orchestrator', 'XState machine not available, using manual state');
+      tridentLog("", 'orchestrator', 'XState machine not available, using manual state');
       return null;
     }

[Survived] BlockStatement
orchestrator.ts:57:22
     }
   }
 
-  startAudit(): void {
-    this.state.mode = 'CODE_REVIEW';
-    this.state.currentLayer = 0;
-    this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'audit' });
-      m?.send({ type: 'SET_MODE', sessionId: 'audit', mode: 'code_review' });
-    }).catch(() => {});
-  }
+  startAudit(): void {}
 
   startPlanning(): void {

[Survived] BlockStatement
orchestrator.ts:61:45
     this.state.mode = 'CODE_REVIEW';
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'audit' });
-      m?.send({ type: 'SET_MODE', sessionId: 'audit', mode: 'code_review' });
-    }).catch(() => {});
+    this.getOrchestratorMachine().then(m => {}).catch(() => {});
   }
 

[Survived] OptionalChaining
orchestrator.ts:62:7
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'audit' });
+      m.send({ type: 'START_SESSION', sessionId: 'audit' });
       m?.send({ type: 'SET_MODE', sessionId: 'audit', mode: 'code_review' });
     }).catch(() => {});

[Survived] StringLiteral
orchestrator.ts:62:51
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'audit' });
+      m?.send({ type: 'START_SESSION', sessionId: "" });
       m?.send({ type: 'SET_MODE', sessionId: 'audit', mode: 'code_review' });
     }).catch(() => {});

[Survived] OptionalChaining
orchestrator.ts:63:7
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'audit' });
-      m?.send({ type: 'SET_MODE', sessionId: 'audit', mode: 'code_review' });
+      m.send({ type: 'SET_MODE', sessionId: 'audit', mode: 'code_review' });
     }).catch(() => {});
   }

[Survived] BlockStatement
orchestrator.ts:67:25
     }).catch(() => {});
   }
 
-  startPlanning(): void {
-    this.state.mode = 'DEEP_PLANNING';
-    this.state.currentLayer = 0;
-    this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'planning' });
-      m?.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
-    }).catch(() => {});
-  }
+  startPlanning(): void {}
 
   startProblemSolving(): void {

[Survived] StringLiteral
orchestrator.ts:68:23
   }
 
   startPlanning(): void {
-    this.state.mode = 'DEEP_PLANNING';
+    this.state.mode = "";
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';

[Survived] StringLiteral
orchestrator.ts:70:25
   startPlanning(): void {
     this.state.mode = 'DEEP_PLANNING';
     this.state.currentLayer = 0;
-    this.state.status = 'RUNNING';
+    this.state.status = "";
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'planning' });

[Survived] BlockStatement
orchestrator.ts:71:45
     this.state.mode = 'DEEP_PLANNING';
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'planning' });
-      m?.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
-    }).catch(() => {});
+    this.getOrchestratorMachine().then(m => {}).catch(() => {});
   }
 

[Survived] OptionalChaining
orchestrator.ts:72:7
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'planning' });
+      m.send({ type: 'START_SESSION', sessionId: 'planning' });
       m?.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
     }).catch(() => {});

[Survived] StringLiteral
orchestrator.ts:72:51
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'planning' });
+      m?.send({ type: 'START_SESSION', sessionId: "" });
       m?.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
     }).catch(() => {});

[Survived] OptionalChaining
orchestrator.ts:73:7
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'planning' });
-      m?.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
+      m.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
     }).catch(() => {});
   }

[Survived] StringLiteral
orchestrator.ts:73:46
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'planning' });
-      m?.send({ type: 'SET_MODE', sessionId: 'planning', mode: 'deep_planning' });
+      m?.send({ type: 'SET_MODE', sessionId: "", mode: 'deep_planning' });
     }).catch(() => {});
   }

[Survived] BlockStatement
orchestrator.ts:77:31
     }).catch(() => {});
   }
 
-  startProblemSolving(): void {
-    this.state.mode = 'PROBLEM_SOLVING';
-    this.state.currentLayer = 0;
-    this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'problem-solving' });
-      m?.send({ type: 'SET_MODE', sessionId: 'problem-solving', mode: 'problem_solving' });
-    }).catch(() => {});
-  }
+  startProblemSolving(): void {}
 
   startContextSynthesis(): void {

[Survived] BlockStatement
orchestrator.ts:81:45
     this.state.mode = 'PROBLEM_SOLVING';
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'problem-solving' });
-      m?.send({ type: 'SET_MODE', sessionId: 'problem-solving', mode: 'problem_solving' });
-    }).catch(() => {});
+    this.getOrchestratorMachine().then(m => {}).catch(() => {});
   }
 

[Survived] OptionalChaining
orchestrator.ts:82:7
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'problem-solving' });
+      m.send({ type: 'START_SESSION', sessionId: 'problem-solving' });
       m?.send({ type: 'SET_MODE', sessionId: 'problem-solving', mode: 'problem_solving' });
     }).catch(() => {});

[Survived] ObjectLiteral
orchestrator.ts:82:15
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'problem-solving' });
+      m?.send({});
       m?.send({ type: 'SET_MODE', sessionId: 'problem-solving', mode: 'problem_solving' });
     }).catch(() => {});

[Survived] OptionalChaining
orchestrator.ts:83:7
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'problem-solving' });
-      m?.send({ type: 'SET_MODE', sessionId: 'problem-solving', mode: 'problem_solving' });
+      m.send({ type: 'SET_MODE', sessionId: 'problem-solving', mode: 'problem_solving' });
     }).catch(() => {});
   }

[Survived] BlockStatement
orchestrator.ts:87:33
     }).catch(() => {});
   }
 
-  startContextSynthesis(): void {
-    this.state.mode = 'CONTEXT_SYNTHESIS';
-    this.state.currentLayer = 0;
-    this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
-      m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
-    }).catch(() => {});
-  }
+  startContextSynthesis(): void {}
 
   completeLayer(): void {

[Survived] BlockStatement
orchestrator.ts:91:45
     this.state.mode = 'CONTEXT_SYNTHESIS';
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
-    this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
-      m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
-    }).catch(() => {});
+    this.getOrchestratorMachine().then(m => {}).catch(() => {});
   }
 

[Survived] OptionalChaining
orchestrator.ts:92:7
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
+      m.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
       m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
     }).catch(() => {});

[Survived] ObjectLiteral
orchestrator.ts:92:15
     this.state.currentLayer = 0;
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
-      m?.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
+      m?.send({});
       m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
     }).catch(() => {});

[Survived] OptionalChaining
orchestrator.ts:93:7
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
-      m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
+      m.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
     }).catch(() => {});
   }

[Survived] StringLiteral
orchestrator.ts:93:73
     this.state.status = 'RUNNING';
     this.getOrchestratorMachine().then(m => {
       m?.send({ type: 'START_SESSION', sessionId: 'context-synthesis' });
-      m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: 'context_synthesis' });
+      m?.send({ type: 'SET_MODE', sessionId: 'context-synthesis', mode: "" });
     }).catch(() => {});
   }

[Survived] BlockStatement
orchestrator.ts:97:25
     }).catch(() => {});
   }
 
-  completeLayer(): void {
-    this.state.currentLayer++;
-    tridentLog('INFO', 'orchestrator', `Layer ${this.state.currentLayer} completed`);
-  }
+  completeLayer(): void {}
 
   failLayer(reason: string): void {

[Survived] UpdateOperator
orchestrator.ts:98:5
   }
 
   completeLayer(): void {
-    this.state.currentLayer++;
+    this.state.currentLayer--;
     tridentLog('INFO', 'orchestrator', `Layer ${this.state.currentLayer} completed`);
   }

[Survived] StringLiteral
orchestrator.ts:99:40
 
   completeLayer(): void {
     this.state.currentLayer++;
-    tridentLog('INFO', 'orchestrator', `Layer ${this.state.currentLayer} completed`);
+    tridentLog('INFO', 'orchestrator', ``);
   }
 

[Survived] BlockStatement
orchestrator.ts:102:35
     tridentLog('INFO', 'orchestrator', `Layer ${this.state.currentLayer} completed`);
   }
 
-  failLayer(reason: string): void {
-    tridentLog('ERROR', 'orchestrator', `Layer ${this.state.currentLayer + 1} failed: ${reason}`);
-    this.state.status = 'ERROR';
-  }
+  failLayer(reason: string): void {}
 
   addArtifact(key: string, value: string): void {

[Survived] ArithmeticOperator
orchestrator.ts:103:50
   }
 
   failLayer(reason: string): void {
-    tridentLog('ERROR', 'orchestrator', `Layer ${this.state.currentLayer + 1} failed: ${reason}`);
+    tridentLog('ERROR', 'orchestrator', `Layer ${this.state.currentLayer - 1} failed: ${reason}`);
     this.state.status = 'ERROR';
   }

[Survived] StringLiteral
orchestrator.ts:103:41
   }
 
   failLayer(reason: string): void {
-    tridentLog('ERROR', 'orchestrator', `Layer ${this.state.currentLayer + 1} failed: ${reason}`);
+    tridentLog('ERROR', 'orchestrator', ``);
     this.state.status = 'ERROR';
   }

[Survived] BlockStatement
orchestrator.ts:107:49
     this.state.status = 'ERROR';
   }
 
-  addArtifact(key: string, value: string): void {
-    this.state.artifacts.set(key, value);
-  }
+  addArtifact(key: string, value: string): void {}
 
   getState(): OrchestratorState {

[Survived] BlockStatement
orchestrator.ts:111:33
     this.state.artifacts.set(key, value);
   }
 
-  getState(): OrchestratorState {
-    return { ...this.state, artifacts: new Map(this.state.artifacts) };
-  }
+  getState(): OrchestratorState {}
 
   getMaxLayers(): number { return this.state.maxLayers; }

[Survived] ObjectLiteral
orchestrator.ts:112:12
   }
 
   getState(): OrchestratorState {
-    return { ...this.state, artifacts: new Map(this.state.artifacts) };
+    return {};
   }
 

[Survived] BlockStatement
orchestrator.ts:115:26
     return { ...this.state, artifacts: new Map(this.state.artifacts) };
   }
 
-  getMaxLayers(): number { return this.state.maxLayers; }
+  getMaxLayers(): number {}
   getCorePrinciple(): string { return 'Trident Audits & Generates Review Artifacts. Build Agents Implement All Changes.'; }
 

[Survived] BlockStatement
orchestrator.ts:116:30
   }
 
   getMaxLayers(): number { return this.state.maxLayers; }
-  getCorePrinciple(): string { return 'Trident Audits & Generates Review Artifacts. Build Agents Implement All Changes.'; }
+  getCorePrinciple(): string {}
 
   // Compatibility methods for hooks

[Survived] BlockStatement
orchestrator.ts:119:39
   getCorePrinciple(): string { return 'Trident Audits & Generates Review Artifacts. Build Agents Implement All Changes.'; }
 
   // Compatibility methods for hooks
-  setSession(sessionId: string): void {
-    tridentLog('INFO', 'orchestrator', `Session set: ${sessionId}`);
-  }
+  setSession(sessionId: string): void {}
 
   resetSession(): void {

[Survived] BlockStatement
orchestrator.ts:123:24
     tridentLog('INFO', 'orchestrator', `Session set: ${sessionId}`);
   }
 
-  resetSession(): void {
-    tridentLog('INFO', 'orchestrator', 'Session reset');
-  }
+  resetSession(): void {}
 
   detectAndSwitch(text: string): void {

[Survived] BlockStatement
orchestrator.ts:127:39
     tridentLog('INFO', 'orchestrator', 'Session reset');
   }
 
-  detectAndSwitch(text: string): void {
-    tridentLog('INFO', 'orchestrator', `Intent detect: ${text.substring(0, 80)}`);
-  }
+  detectAndSwitch(text: string): void {}
 
   setIdentityLoaded(v: boolean): void {

[Timeout] MethodExpression
orchestrator.ts:128:58
   }
 
   detectAndSwitch(text: string): void {
-    tridentLog('INFO', 'orchestrator', `Intent detect: ${text.substring(0, 80)}`);
+    tridentLog('INFO', 'orchestrator', `Intent detect: ${text}`);
   }
 

[Survived] BlockStatement
orchestrator.ts:131:39
     tridentLog('INFO', 'orchestrator', `Intent detect: ${text.substring(0, 80)}`);
   }
 
-  setIdentityLoaded(v: boolean): void {
-    this.state.identityLoaded = v;
-  }
+  setIdentityLoaded(v: boolean): void {}
 
   reset(): void {

[Survived] BlockStatement
orchestrator.ts:135:17
     this.state.identityLoaded = v;
   }
 
-  reset(): void {
-    this.state = {
-      mode: 'IDLE', currentLayer: 0, maxLayers: 17,
-      iteration: 'V4.3.1', status: 'IDLE', initialized: true,
-      identityLoaded: true, artifacts: new Map(), lastIntent: null,
-    };
-  }
+  reset(): void {}
 }
 

[Survived] BooleanLiteral
orchestrator.ts:138:57
   reset(): void {
     this.state = {
       mode: 'IDLE', currentLayer: 0, maxLayers: 17,
-      iteration: 'V4.3.1', status: 'IDLE', initialized: true,
+      iteration: 'V4.3.1', status: 'IDLE', initialized: false,
       identityLoaded: true, artifacts: new Map(), lastIntent: null,
     };

[Survived] BooleanLiteral
orchestrator.ts:139:23
     this.state = {
       mode: 'IDLE', currentLayer: 0, maxLayers: 17,
       iteration: 'V4.3.1', status: 'IDLE', initialized: true,
-      identityLoaded: true, artifacts: new Map(), lastIntent: null,
+      identityLoaded: false, artifacts: new Map(), lastIntent: null,
     };
   }
