[Survived] BlockStatement
tools/trident-tools.ts:21:50
 
 export type ToolResult<T> = { ok: true; data: T } | { ok: false; error: string };
 
-function toolResultOk<T>(data: T): ToolResult<T> {
-  return { ok: true, data };
-}
+function toolResultOk<T>(data: T): ToolResult<T> {}
 
 function toolResultErr<T>(error: string): ToolResult<T> {

[Survived] BooleanLiteral
tools/trident-tools.ts:22:16
 export type ToolResult<T> = { ok: true; data: T } | { ok: false; error: string };
 
 function toolResultOk<T>(data: T): ToolResult<T> {
-  return { ok: true, data };
+  return { ok: false, data };
 }
 

[Survived] BlockStatement
tools/trident-tools.ts:25:57
   return { ok: true, data };
 }
 
-function toolResultErr<T>(error: string): ToolResult<T> {
-  return { ok: false, error };
-}
+function toolResultErr<T>(error: string): ToolResult<T> {}
 
 // M7: No shared singleton — create fresh AuditEngine per invocation

[Survived] BooleanLiteral
tools/trident-tools.ts:26:16
 }
 
 function toolResultErr<T>(error: string): ToolResult<T> {
-  return { ok: false, error };
+  return { ok: true, error };
 }
 

[Survived] ObjectLiteral
tools/trident-tools.ts:26:10
 }
 
 function toolResultErr<T>(error: string): ToolResult<T> {
-  return { ok: false, error };
+  return {};
 }
 

[Survived] BlockStatement
tools/trident-tools.ts:33:72
 // M3: Wire completeLayer/failLayer for state machine hardening
 
 // FINDING #10 FIX: Async readFile instead of sync readFileSync
-async function resolveProjectName(targetPath: string): Promise<string> {
-  const pkgPath = path.join(targetPath, 'package.json');
-  try {
-    const content = await fs.readFile(pkgPath, 'utf-8');
-    const pkg = JSON.parse(content);
-    if (pkg?.name) return pkg.name;
-  } catch (e) {
-    tridentLog('WARN', 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);
-  }
-  return path.basename(targetPath);
-}
+async function resolveProjectName(targetPath: string): Promise<string> {}
 
 // FINDING #5 FIX: Write artifact .md files to disk so they survive session end

[Survived] BlockStatement
tools/trident-tools.ts:35:7
 // FINDING #10 FIX: Async readFile instead of sync readFileSync
 async function resolveProjectName(targetPath: string): Promise<string> {
   const pkgPath = path.join(targetPath, 'package.json');
-  try {
-    const content = await fs.readFile(pkgPath, 'utf-8');
-    const pkg = JSON.parse(content);
-    if (pkg?.name) return pkg.name;
-  } catch (e) {
+  try {} catch (e) {
     tridentLog('WARN', 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);
   }

[Survived] OptionalChaining
tools/trident-tools.ts:38:9
   try {
     const content = await fs.readFile(pkgPath, 'utf-8');
     const pkg = JSON.parse(content);
-    if (pkg?.name) return pkg.name;
+    if (pkg.name) return pkg.name;
   } catch (e) {
     tridentLog('WARN', 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);

[Survived] ConditionalExpression
tools/trident-tools.ts:38:9
   try {
     const content = await fs.readFile(pkgPath, 'utf-8');
     const pkg = JSON.parse(content);
-    if (pkg?.name) return pkg.name;
+    if (true) return pkg.name;
   } catch (e) {
     tridentLog('WARN', 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);

[Survived] BlockStatement
tools/trident-tools.ts:39:15
     const content = await fs.readFile(pkgPath, 'utf-8');
     const pkg = JSON.parse(content);
     if (pkg?.name) return pkg.name;
-  } catch (e) {
-    tridentLog('WARN', 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);
-  }
+  } catch (e) {}
   return path.basename(targetPath);
 }

[Survived] StringLiteral
tools/trident-tools.ts:40:16
     const pkg = JSON.parse(content);
     if (pkg?.name) return pkg.name;
   } catch (e) {
-    tridentLog('WARN', 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);
+    tridentLog("", 'trident-tools', `resolveProjectName: no package.json at ${targetPath}`);
   }
   return path.basename(targetPath);

[Survived] StringLiteral
tools/trident-tools.ts:51:16
 const ARTIFACTS_BASE = TRIDENT_CONFIG.artifactsBase;
 
 const MODE_FOLDERS: Record<string, string> = {
-  CODE_REVIEW: 'CODE_REVIEW',
+  CODE_REVIEW: "",
   BUILD_SPEC: 'BUILD_SPEC',
   PLAN: 'PLAN',

[Survived] StringLiteral
tools/trident-tools.ts:52:15
 
 const MODE_FOLDERS: Record<string, string> = {
   CODE_REVIEW: 'CODE_REVIEW',
-  BUILD_SPEC: 'BUILD_SPEC',
+  BUILD_SPEC: "",
   PLAN: 'PLAN',
   T1_INJECTABLE: 'T1_INJECTABLE',

[Survived] Regex
tools/trident-tools.ts:59:33
 
 function extractSemanticName(content: string, modeFolder: string): string {
   // Strategy 1: Extract first # H1 heading from the markdown content
-  const h1Match = content.match(/^#\s+(.+)$/m);
+  const h1Match = content.match(/^#\S+(.+)$/m);
   if (h1Match) {
     let name = h1Match[1].trim()

[Survived] ConditionalExpression
tools/trident-tools.ts:60:7
 function extractSemanticName(content: string, modeFolder: string): string {
   // Strategy 1: Extract first # H1 heading from the markdown content
   const h1Match = content.match(/^#\s+(.+)$/m);
-  if (h1Match) {
+  if (false) {
     let name = h1Match[1].trim()
       .replace(/\*\*/g, '')           // remove bold markers

[Survived] BlockStatement
tools/trident-tools.ts:60:16
 function extractSemanticName(content: string, modeFolder: string): string {
   // Strategy 1: Extract first # H1 heading from the markdown content
   const h1Match = content.match(/^#\s+(.+)$/m);
-  if (h1Match) {
-    let name = h1Match[1].trim()
-      .replace(/\*\*/g, '')           // remove bold markers
-      .replace(/[`'"“”]/g, '')         // remove quotes
-      .replace(/[—–-]+/g, '_')         // replace dashes with underscore
-      .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
-      .trim()
-      .replace(/\s+/g, '_')           // spaces to underscores
-      .replace(/_+/g, '_')            // collapse multiple underscores
-      .replace(/^_|_$/g, '')           // trim leading/trailing underscores
-      .toUpperCase();
-    
-    // Limit length but keep it meaningful
-    if (name.length > 100) name = name.substring(0, 100);
-    if (name.length >= 10) return name;
-  }
+  if (h1Match) {}
   
   // Strategy 2: Look for "Project:" or "Project Name:" metadata

[Survived] MethodExpression
tools/trident-tools.ts:61:16
   // Strategy 1: Extract first # H1 heading from the markdown content
   const h1Match = content.match(/^#\s+(.+)$/m);
   if (h1Match) {
-    let name = h1Match[1].trim()
-      .replace(/\*\*/g, '')           // remove bold markers
-      .replace(/[`'"“”]/g, '')         // remove quotes
-      .replace(/[—–-]+/g, '_')         // replace dashes with underscore
-      .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
-      .trim()
-      .replace(/\s+/g, '_')           // spaces to underscores
-      .replace(/_+/g, '_')            // collapse multiple underscores
-      .replace(/^_|_$/g, '')           // trim leading/trailing underscores
-      .toUpperCase();
+    let name = h1Match[1].trim().replace(/\*\*/g, '') // remove bold markers
+.replace(/[`'"“”]/g, '') // remove quotes
+.replace(/[—–-]+/g, '_') // replace dashes with underscore
+.replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
+.trim().replace(/\s+/g, '_') // spaces to underscores
+.replace(/_+/g, '_') // collapse multiple underscores
+.replace(/^_|_$/g, '') // trim leading/trailing underscores
+.toLowerCase();
     
     // Limit length but keep it meaningful

[Survived] MethodExpression
tools/trident-tools.ts:61:16
   // Strategy 1: Extract first # H1 heading from the markdown content
   const h1Match = content.match(/^#\s+(.+)$/m);
   if (h1Match) {
-    let name = h1Match[1].trim()
-      .replace(/\*\*/g, '')           // remove bold markers
-      .replace(/[`'"“”]/g, '')         // remove quotes
-      .replace(/[—–-]+/g, '_')         // replace dashes with underscore
-      .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
-      .trim()
+    let name = h1Match[1].trim().replace(/\*\*/g, '') // remove bold markers
+.replace(/[`'"“”]/g, '') // remove quotes
+.replace(/[—–-]+/g, '_') // replace dashes with underscore
+.replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
       .replace(/\s+/g, '_')           // spaces to underscores
       .replace(/_+/g, '_')            // collapse multiple underscores

[Survived] Regex
tools/trident-tools.ts:64:16
     let name = h1Match[1].trim()
       .replace(/\*\*/g, '')           // remove bold markers
       .replace(/[`'"“”]/g, '')         // remove quotes
-      .replace(/[—–-]+/g, '_')         // replace dashes with underscore
+      .replace(/[^—–-]+/g, '_')         // replace dashes with underscore
       .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
       .trim()

[Survived] StringLiteral
tools/trident-tools.ts:65:35
       .replace(/\*\*/g, '')           // remove bold markers
       .replace(/[`'"“”]/g, '')         // remove quotes
       .replace(/[—–-]+/g, '_')         // replace dashes with underscore
-      .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
+      .replace(/[^a-zA-Z0-9_ ]/g, "Stryker was here!") // remove other special chars
       .trim()
       .replace(/\s+/g, '_')           // spaces to underscores

[Survived] StringLiteral
tools/trident-tools.ts:67:24
       .replace(/[—–-]+/g, '_')         // replace dashes with underscore
       .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
       .trim()
-      .replace(/\s+/g, '_')           // spaces to underscores
+      .replace(/\s+/g, "")           // spaces to underscores
       .replace(/_+/g, '_')            // collapse multiple underscores
       .replace(/^_|_$/g, '')           // trim leading/trailing underscores

[Survived] StringLiteral
tools/trident-tools.ts:68:23
       .replace(/[^a-zA-Z0-9_ ]/g, '') // remove other special chars
       .trim()
       .replace(/\s+/g, '_')           // spaces to underscores
-      .replace(/_+/g, '_')            // collapse multiple underscores
+      .replace(/_+/g, "")            // collapse multiple underscores
       .replace(/^_|_$/g, '')           // trim leading/trailing underscores
       .toUpperCase();

[Survived] StringLiteral
tools/trident-tools.ts:69:26
       .trim()
       .replace(/\s+/g, '_')           // spaces to underscores
       .replace(/_+/g, '_')            // collapse multiple underscores
-      .replace(/^_|_$/g, '')           // trim leading/trailing underscores
+      .replace(/^_|_$/g, "Stryker was here!")           // trim leading/trailing underscores
       .toUpperCase();
     

[Survived] ConditionalExpression
tools/trident-tools.ts:73:9
       .toUpperCase();
     
     // Limit length but keep it meaningful
-    if (name.length > 100) name = name.substring(0, 100);
+    if (true) name = name.substring(0, 100);
     if (name.length >= 10) return name;
   }

[Survived] EqualityOperator
tools/trident-tools.ts:73:9
       .toUpperCase();
     
     // Limit length but keep it meaningful
-    if (name.length > 100) name = name.substring(0, 100);
+    if (name.length <= 100) name = name.substring(0, 100);
     if (name.length >= 10) return name;
   }

[Survived] ConditionalExpression
tools/trident-tools.ts:74:9
     
     // Limit length but keep it meaningful
     if (name.length > 100) name = name.substring(0, 100);
-    if (name.length >= 10) return name;
+    if (false) return name;
   }
   

[Survived] EqualityOperator
tools/trident-tools.ts:74:9
     
     // Limit length but keep it meaningful
     if (name.length > 100) name = name.substring(0, 100);
-    if (name.length >= 10) return name;
+    if (name.length > 10) return name;
   }
   

[Survived] Regex
tools/trident-tools.ts:78:38
   }
   
   // Strategy 2: Look for "Project:" or "Project Name:" metadata
-  const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
+  const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\S*(.+?)(?:\n|$)/i);
   if (projectMatch) {
     let name = projectMatch[1].trim()

[Survived] Regex
tools/trident-tools.ts:78:38
   }
   
   // Strategy 2: Look for "Project:" or "Project Name:" metadata
-  const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
+  const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n)/i);
   if (projectMatch) {
     let name = projectMatch[1].trim()

[Survived] BlockStatement
tools/trident-tools.ts:79:21
   
   // Strategy 2: Look for "Project:" or "Project Name:" metadata
   const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
-  if (projectMatch) {
-    let name = projectMatch[1].trim()
-      .replace(/[^a-zA-Z0-9_ ]/g, '')
-      .trim()
-      .replace(/\s+/g, '_')
-      .toUpperCase();
-    if (name.length > 5) return `${modeFolder}_${name}`;
-  }
+  if (projectMatch) {}
   
   // Strategy 3: Look for a title-like pattern in the first 200 chars

[Survived] ConditionalExpression
tools/trident-tools.ts:79:7
   
   // Strategy 2: Look for "Project:" or "Project Name:" metadata
   const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
-  if (projectMatch) {
+  if (true) {
     let name = projectMatch[1].trim()
       .replace(/[^a-zA-Z0-9_ ]/g, '')

[Survived] MethodExpression
tools/trident-tools.ts:80:16
   // Strategy 2: Look for "Project:" or "Project Name:" metadata
   const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
   if (projectMatch) {
-    let name = projectMatch[1].trim()
-      .replace(/[^a-zA-Z0-9_ ]/g, '')
-      .trim()
-      .replace(/\s+/g, '_')
-      .toUpperCase();
+    let name = projectMatch[1].trim().replace(/[^a-zA-Z0-9_ ]/g, '').trim().replace(/\s+/g, '_').toLowerCase();
     if (name.length > 5) return `${modeFolder}_${name}`;
   }

[Survived] MethodExpression
tools/trident-tools.ts:80:16
   // Strategy 2: Look for "Project:" or "Project Name:" metadata
   const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
   if (projectMatch) {
-    let name = projectMatch[1].trim()
-      .replace(/[^a-zA-Z0-9_ ]/g, '')
-      .trim()
+    let name = projectMatch[1].trim().replace(/[^a-zA-Z0-9_ ]/g, '')
       .replace(/\s+/g, '_')
       .toUpperCase();

[Survived] StringLiteral
tools/trident-tools.ts:81:35
   const projectMatch = content.match(/\*{0,2}(?:Project|Plugin|Package)\s*Name?\s*\*{0,2}:?\s*(.+?)(?:\n|$)/i);
   if (projectMatch) {
     let name = projectMatch[1].trim()
-      .replace(/[^a-zA-Z0-9_ ]/g, '')
+      .replace(/[^a-zA-Z0-9_ ]/g, "Stryker was here!")
       .trim()
       .replace(/\s+/g, '_')

[Survived] Regex
tools/trident-tools.ts:83:16
     let name = projectMatch[1].trim()
       .replace(/[^a-zA-Z0-9_ ]/g, '')
       .trim()
-      .replace(/\s+/g, '_')
+      .replace(/\S+/g, '_')
       .toUpperCase();
     if (name.length > 5) return `${modeFolder}_${name}`;

[Survived] StringLiteral
tools/trident-tools.ts:83:24
     let name = projectMatch[1].trim()
       .replace(/[^a-zA-Z0-9_ ]/g, '')
       .trim()
-      .replace(/\s+/g, '_')
+      .replace(/\s+/g, "")
       .toUpperCase();
     if (name.length > 5) return `${modeFolder}_${name}`;

[Survived] EqualityOperator
tools/trident-tools.ts:85:9
       .trim()
       .replace(/\s+/g, '_')
       .toUpperCase();
-    if (name.length > 5) return `${modeFolder}_${name}`;
+    if (name.length >= 5) return `${modeFolder}_${name}`;
   }
   

[Survived] EqualityOperator
tools/trident-tools.ts:85:9
       .trim()
       .replace(/\s+/g, '_')
       .toUpperCase();
-    if (name.length > 5) return `${modeFolder}_${name}`;
+    if (name.length <= 5) return `${modeFolder}_${name}`;
   }
   

[Survived] MethodExpression
tools/trident-tools.ts:89:22
   }
   
   // Strategy 3: Look for a title-like pattern in the first 200 chars
-  const firstLines = content.substring(0, 200);
+  const firstLines = content;
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
   if (titleMatch) {

[Survived] ConditionalExpression
tools/trident-tools.ts:91:7
   // Strategy 3: Look for a title-like pattern in the first 200 chars
   const firstLines = content.substring(0, 200);
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
-  if (titleMatch) {
+  if (true) {
     let name = titleMatch[0].trim().replace(/\s+/g, '_').toUpperCase();
     if (name.length > 5) return name;

[Survived] BlockStatement
tools/trident-tools.ts:91:19
   // Strategy 3: Look for a title-like pattern in the first 200 chars
   const firstLines = content.substring(0, 200);
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
-  if (titleMatch) {
-    let name = titleMatch[0].trim().replace(/\s+/g, '_').toUpperCase();
-    if (name.length > 5) return name;
-  }
+  if (titleMatch) {}
   
   // Strategy 4: Extract from content context — look for significant keywords

[Survived] MethodExpression
tools/trident-tools.ts:92:16
   const firstLines = content.substring(0, 200);
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
   if (titleMatch) {
-    let name = titleMatch[0].trim().replace(/\s+/g, '_').toUpperCase();
+    let name = titleMatch[0].trim().replace(/\s+/g, '_').toLowerCase();
     if (name.length > 5) return name;
   }

[Survived] MethodExpression
tools/trident-tools.ts:92:16
   const firstLines = content.substring(0, 200);
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
   if (titleMatch) {
-    let name = titleMatch[0].trim().replace(/\s+/g, '_').toUpperCase();
+    let name = titleMatch[0].replace(/\s+/g, '_').toUpperCase();
     if (name.length > 5) return name;
   }

[Survived] EqualityOperator
tools/trident-tools.ts:93:9
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
   if (titleMatch) {
     let name = titleMatch[0].trim().replace(/\s+/g, '_').toUpperCase();
-    if (name.length > 5) return name;
+    if (name.length >= 5) return name;
   }
   

[Survived] ConditionalExpression
tools/trident-tools.ts:93:9
   const titleMatch = firstLines.match(/^[A-Z][A-Za-z0-9\s\-_]{5,60}$/m);
   if (titleMatch) {
     let name = titleMatch[0].trim().replace(/\s+/g, '_').toUpperCase();
-    if (name.length > 5) return name;
+    if (false) return name;
   }
   

[Survived] Regex
tools/trident-tools.ts:97:38
   }
   
   // Strategy 4: Extract from content context — look for significant keywords
-  const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
+  const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\W+\s*){0,4}/i);
   if (contextMatch) {
     let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();

[Survived] Regex
tools/trident-tools.ts:97:38
   }
   
   // Strategy 4: Extract from content context — look for significant keywords
-  const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
+  const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*)/i);
   if (contextMatch) {
     let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();

[Survived] BlockStatement
tools/trident-tools.ts:98:21
   
   // Strategy 4: Extract from content context — look for significant keywords
   const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
-  if (contextMatch) {
-    let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
-    if (name.length > 5) return name;
-  }
+  if (contextMatch) {}
   
   // Final fallback: mode folder name with a unique content hash

[Survived] ConditionalExpression
tools/trident-tools.ts:98:7
   
   // Strategy 4: Extract from content context — look for significant keywords
   const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
-  if (contextMatch) {
+  if (false) {
     let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
     if (name.length > 5) return name;

[Survived] MethodExpression
tools/trident-tools.ts:99:35
   // Strategy 4: Extract from content context — look for significant keywords
   const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
   if (contextMatch) {
-    let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
+    let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toLowerCase();
     if (name.length > 5) return name;
   }

[Survived] MethodExpression
tools/trident-tools.ts:99:35
   // Strategy 4: Extract from content context — look for significant keywords
   const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
   if (contextMatch) {
-    let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
+    let name = modeFolder + '_' + contextMatch[0].replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
     if (name.length > 5) return name;
   }

[Survived] ConditionalExpression
tools/trident-tools.ts:100:9
   const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
   if (contextMatch) {
     let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
-    if (name.length > 5) return name;
+    if (false) return name;
   }
   

[Survived] EqualityOperator
tools/trident-tools.ts:100:9
   const contextMatch = content.match(/(?:TRIDENT|Audit|Review|Plan|Spec|Build|Context|Injectable)\s*(?:\w+\s*){0,4}/i);
   if (contextMatch) {
     let name = modeFolder + '_' + contextMatch[0].trim().replace(/\s+/g, '_').replace(/[^a-zA-Z0-9_]/g, '').toUpperCase();
-    if (name.length > 5) return name;
+    if (name.length >= 5) return name;
   }
   

[Survived] MethodExpression
tools/trident-tools.ts:104:57
   }
   
   // Final fallback: mode folder name with a unique content hash
-  const shortHash = content.length.toString(16) + '-' + content.substring(0, 20).replace(/[^a-zA-Z0-9]/g, '').toUpperCase();
+  const shortHash = content.length.toString(16) + '-' + content.replace(/[^a-zA-Z0-9]/g, '').toUpperCase();
   return `${modeFolder}_${shortHash}`;
 }

[Survived] MethodExpression
tools/trident-tools.ts:104:57
   }
   
   // Final fallback: mode folder name with a unique content hash
-  const shortHash = content.length.toString(16) + '-' + content.substring(0, 20).replace(/[^a-zA-Z0-9]/g, '').toUpperCase();
+  const shortHash = content.length.toString(16) + '-' + content.substring(0, 20).replace(/[^a-zA-Z0-9]/g, '').toLowerCase();
   return `${modeFolder}_${shortHash}`;
 }

[Survived] BlockStatement
tools/trident-tools.ts:108:63
   return `${modeFolder}_${shortHash}`;
 }
 
-async function fileExists(filePath: string): Promise<boolean> {
-  try { await fs.access(filePath); return true; } catch { return false; }
-}
+async function fileExists(filePath: string): Promise<boolean> {}
 
 async function writeArtifactFile(modeFolder: string, content: string): Promise<string> {

[Survived] BlockStatement
tools/trident-tools.ts:109:57
 }
 
 async function fileExists(filePath: string): Promise<boolean> {
-  try { await fs.access(filePath); return true; } catch { return false; }
+  try { await fs.access(filePath); return true; } catch {}
 }
 

[Survived] BlockStatement
tools/trident-tools.ts:109:7
 }
 
 async function fileExists(filePath: string): Promise<boolean> {
-  try { await fs.access(filePath); return true; } catch { return false; }
+  try {} catch { return false; }
 }
 

[Survived] ConditionalExpression
tools/trident-tools.ts:113:18
 }
 
 async function writeArtifactFile(modeFolder: string, content: string): Promise<string> {
-  const folder = MODE_FOLDERS[modeFolder] || modeFolder;
+  const folder = false;
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
   try {

[Survived] ConditionalExpression
tools/trident-tools.ts:113:18
 }
 
 async function writeArtifactFile(modeFolder: string, content: string): Promise<string> {
-  const folder = MODE_FOLDERS[modeFolder] || modeFolder;
+  const folder = true;
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
   try {

[Survived] BlockStatement
tools/trident-tools.ts:115:7
 async function writeArtifactFile(modeFolder: string, content: string): Promise<string> {
   const folder = MODE_FOLDERS[modeFolder] || modeFolder;
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
-  try {
-    if (!(await fileExists(artifactDir))) {
-      await fs.mkdir(artifactDir, { recursive: true });
-    }
-    const semanticName = extractSemanticName(content, modeFolder);
-    const fileName = `${semanticName}.md`;
-    const filePath = path.join(artifactDir, fileName);
-
-    let finalPath = filePath;
-    let counter = 1;
-    while (await fileExists(finalPath)) {
-      finalPath = path.join(artifactDir, `${semanticName}_${counter}.md`);
-      counter++;
-    }
-
-    await fs.writeFile(finalPath, content, 'utf-8');
-    tridentLog('INFO', 'trident-tools', `Artifact saved: ${finalPath}`);
-    return finalPath;
-  } catch (err) {
+  try {} catch (err) {
     tridentLog('ERROR', 'trident-tools', `writeArtifactFile failed: ${(err as Error).message}`);
     return '';

[Survived] ConditionalExpression
tools/trident-tools.ts:116:9
   const folder = MODE_FOLDERS[modeFolder] || modeFolder;
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
   try {
-    if (!(await fileExists(artifactDir))) {
+    if (true) {
       await fs.mkdir(artifactDir, { recursive: true });
     }

[Survived] BooleanLiteral
tools/trident-tools.ts:116:9
   const folder = MODE_FOLDERS[modeFolder] || modeFolder;
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
   try {
-    if (!(await fileExists(artifactDir))) {
+    if (await fileExists(artifactDir)) {
       await fs.mkdir(artifactDir, { recursive: true });
     }

[Survived] BooleanLiteral
tools/trident-tools.ts:117:48
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
   try {
     if (!(await fileExists(artifactDir))) {
-      await fs.mkdir(artifactDir, { recursive: true });
+      await fs.mkdir(artifactDir, { recursive: false });
     }
     const semanticName = extractSemanticName(content, modeFolder);

[Survived] ObjectLiteral
tools/trident-tools.ts:117:35
   const artifactDir = path.join(ARTIFACTS_BASE, folder);
   try {
     if (!(await fileExists(artifactDir))) {
-      await fs.mkdir(artifactDir, { recursive: true });
+      await fs.mkdir(artifactDir, {});
     }
     const semanticName = extractSemanticName(content, modeFolder);

[Survived] ConditionalExpression
tools/trident-tools.ts:125:12
 
     let finalPath = filePath;
     let counter = 1;
-    while (await fileExists(finalPath)) {
+    while (false) {
       finalPath = path.join(artifactDir, `${semanticName}_${counter}.md`);
       counter++;

[Survived] BlockStatement
tools/trident-tools.ts:125:41
 
     let finalPath = filePath;
     let counter = 1;
-    while (await fileExists(finalPath)) {
-      finalPath = path.join(artifactDir, `${semanticName}_${counter}.md`);
-      counter++;
-    }
+    while (await fileExists(finalPath)) {}
 
     await fs.writeFile(finalPath, content, 'utf-8');

[Survived] UpdateOperator
tools/trident-tools.ts:127:7
     let counter = 1;
     while (await fileExists(finalPath)) {
       finalPath = path.join(artifactDir, `${semanticName}_${counter}.md`);
-      counter++;
+      counter--;
     }
 

[Survived] StringLiteral
tools/trident-tools.ts:131:24
     }
 
     await fs.writeFile(finalPath, content, 'utf-8');
-    tridentLog('INFO', 'trident-tools', `Artifact saved: ${finalPath}`);
+    tridentLog('INFO', "", `Artifact saved: ${finalPath}`);
     return finalPath;
   } catch (err) {

[Survived] BlockStatement
tools/trident-tools.ts:133:17
     await fs.writeFile(finalPath, content, 'utf-8');
     tridentLog('INFO', 'trident-tools', `Artifact saved: ${finalPath}`);
     return finalPath;
-  } catch (err) {
-    tridentLog('ERROR', 'trident-tools', `writeArtifactFile failed: ${(err as Error).message}`);
-    return '';
-  }
+  } catch (err) {}
 }
 

[Survived] StringLiteral
tools/trident-tools.ts:134:42
     tridentLog('INFO', 'trident-tools', `Artifact saved: ${finalPath}`);
     return finalPath;
   } catch (err) {
-    tridentLog('ERROR', 'trident-tools', `writeArtifactFile failed: ${(err as Error).message}`);
+    tridentLog('ERROR', 'trident-tools', ``);
     return '';
   }

[Survived] BlockStatement
tools/trident-tools.ts:139:66
   }
 }
 
-function storeArtifacts(artifacts: Record<string, string>): void {
-  for (const [key, value] of Object.entries(artifacts)) {
-    orchestrator.addArtifact(key, value);
-  }
-}
+function storeArtifacts(artifacts: Record<string, string>): void {}
 
 function formatValidationReport(

[Survived] BlockStatement
tools/trident-tools.ts:140:57
 }
 
 function storeArtifacts(artifacts: Record<string, string>): void {
-  for (const [key, value] of Object.entries(artifacts)) {
-    orchestrator.addArtifact(key, value);
-  }
+  for (const [key, value] of Object.entries(artifacts)) {}
 }
 
