[Survived] ArrowFunction
tools/trident-tools.ts:149:40
   validations: Array<{ layer: number; name: string; valid: boolean; missing: string[] }>,
   modeName: string
 ): string {
-  const passCount = validations.filter(v => v.valid).length;
+  const passCount = validations.filter(() => undefined).length;
   const allValid = passCount === validations.length;
   const noneValid = passCount === 0;

[Survived] MethodExpression
tools/trident-tools.ts:149:21
   validations: Array<{ layer: number; name: string; valid: boolean; missing: string[] }>,
   modeName: string
 ): string {
-  const passCount = validations.filter(v => v.valid).length;
+  const passCount = validations.length;
   const allValid = passCount === validations.length;
   const noneValid = passCount === 0;

[Survived] ConditionalExpression
tools/trident-tools.ts:150:20
   modeName: string
 ): string {
   const passCount = validations.filter(v => v.valid).length;
-  const allValid = passCount === validations.length;
+  const allValid = false;
   const noneValid = passCount === 0;
 

[Survived] ConditionalExpression
tools/trident-tools.ts:150:20
   modeName: string
 ): string {
   const passCount = validations.filter(v => v.valid).length;
-  const allValid = passCount === validations.length;
+  const allValid = true;
   const noneValid = passCount === 0;
 

[Survived] ConditionalExpression
tools/trident-tools.ts:151:21
 ): string {
   const passCount = validations.filter(v => v.valid).length;
   const allValid = passCount === validations.length;
-  const noneValid = passCount === 0;
+  const noneValid = true;
 
   // When all layers are partial, input was too minimal — skip validation theater

[Survived] EqualityOperator
tools/trident-tools.ts:151:21
 ): string {
   const passCount = validations.filter(v => v.valid).length;
   const allValid = passCount === validations.length;
-  const noneValid = passCount === 0;
+  const noneValid = passCount !== 0;
 
   // When all layers are partial, input was too minimal — skip validation theater

[Survived] EqualityOperator
tools/trident-tools.ts:154:20
   const noneValid = passCount === 0;
 
   // When all layers are partial, input was too minimal — skip validation theater
-  if (noneValid && validations.length > 0) {
+  if (noneValid && validations.length >= 0) {
     let r = `## Mode Validation — ${modeName}\n\n`;
     r += `**Result:** SKIPPED — Input too minimal for validation (${validations.length} layers checked, 0 passed)\n\n`;

[Survived] EqualityOperator
tools/trident-tools.ts:154:20
   const noneValid = passCount === 0;
 
   // When all layers are partial, input was too minimal — skip validation theater
-  if (noneValid && validations.length > 0) {
+  if (noneValid && validations.length <= 0) {
     let r = `## Mode Validation — ${modeName}\n\n`;
     r += `**Result:** SKIPPED — Input too minimal for validation (${validations.length} layers checked, 0 passed)\n\n`;

[Survived] StringLiteral
tools/trident-tools.ts:156:10
   // When all layers are partial, input was too minimal — skip validation theater
   if (noneValid && validations.length > 0) {
     let r = `## Mode Validation — ${modeName}\n\n`;
-    r += `**Result:** SKIPPED — Input too minimal for validation (${validations.length} layers checked, 0 passed)\n\n`;
+    r += ``;
     r += `Validation requires detailed input parameters. Re-run with richer requirements, architecture, and patterns for a full validation.\n`;
     return r;

[Survived] StringLiteral
tools/trident-tools.ts:157:10
   if (noneValid && validations.length > 0) {
     let r = `## Mode Validation — ${modeName}\n\n`;
     r += `**Result:** SKIPPED — Input too minimal for validation (${validations.length} layers checked, 0 passed)\n\n`;
-    r += `Validation requires detailed input parameters. Re-run with richer requirements, architecture, and patterns for a full validation.\n`;
+    r += ``;
     return r;
   }

[Survived] StringLiteral
tools/trident-tools.ts:162:43
   }
 
   let r = `## Mode Validation — ${modeName}\n\n`;
-  r += `**Result:** ${allValid ? 'PASS' : 'PARTIAL'} (${passCount}/${validations.length} layers validated)\n\n`;
+  r += `**Result:** ${allValid ? 'PASS' : ""} (${passCount}/${validations.length} layers validated)\n\n`;
   r += `| Layer | Name | Status | Missing Requirements |\n`;
   r += `|-------|------|--------|---------------------|\n`;

[Survived] StringLiteral
tools/trident-tools.ts:163:8
 
   let r = `## Mode Validation — ${modeName}\n\n`;
   r += `**Result:** ${allValid ? 'PASS' : 'PARTIAL'} (${passCount}/${validations.length} layers validated)\n\n`;
-  r += `| Layer | Name | Status | Missing Requirements |\n`;
+  r += ``;
   r += `|-------|------|--------|---------------------|\n`;
   for (const v of validations) {

[Survived] StringLiteral
tools/trident-tools.ts:164:8
   let r = `## Mode Validation — ${modeName}\n\n`;
   r += `**Result:** ${allValid ? 'PASS' : 'PARTIAL'} (${passCount}/${validations.length} layers validated)\n\n`;
   r += `| Layer | Name | Status | Missing Requirements |\n`;
-  r += `|-------|------|--------|---------------------|\n`;
+  r += ``;
   for (const v of validations) {
     r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;

[Survived] BlockStatement
tools/trident-tools.ts:165:32
   r += `**Result:** ${allValid ? 'PASS' : 'PARTIAL'} (${passCount}/${validations.length} layers validated)\n\n`;
   r += `| Layer | Name | Status | Missing Requirements |\n`;
   r += `|-------|------|--------|---------------------|\n`;
-  for (const v of validations) {
-    r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;
-  }
+  for (const v of validations) {}
   r += `\n`;
   if (!allValid) {

[Survived] EqualityOperator
tools/trident-tools.ts:166:74
   r += `| Layer | Name | Status | Missing Requirements |\n`;
   r += `|-------|------|--------|---------------------|\n`;
   for (const v of validations) {
-    r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;
+    r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length <= 0 ? v.missing.join(', ') : '—'} |\n`;
   }
   r += `\n`;

[Survived] ConditionalExpression
tools/trident-tools.ts:166:74
   r += `| Layer | Name | Status | Missing Requirements |\n`;
   r += `|-------|------|--------|---------------------|\n`;
   for (const v of validations) {
-    r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;
+    r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${false ? v.missing.join(', ') : '—'} |\n`;
   }
   r += `\n`;

[Survived] StringLiteral
tools/trident-tools.ts:168:8
   for (const v of validations) {
     r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;
   }
-  r += `\n`;
+  r += ``;
   if (!allValid) {
     r += `**Note:** Missing requirements indicate content that would benefit from more detailed input parameters.\n`;

[Survived] BooleanLiteral
tools/trident-tools.ts:169:7
     r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;
   }
   r += `\n`;
-  if (!allValid) {
+  if (allValid) {
     r += `**Note:** Missing requirements indicate content that would benefit from more detailed input parameters.\n`;
   }

[Survived] ConditionalExpression
tools/trident-tools.ts:169:7
     r += `| ${v.layer} | ${v.name} | ${v.valid ? 'PASS' : 'PARTIAL'} | ${v.missing.length > 0 ? v.missing.join(', ') : '—'} |\n`;
   }
   r += `\n`;
-  if (!allValid) {
+  if (true) {
     r += `**Note:** Missing requirements indicate content that would benefit from more detailed input parameters.\n`;
   }

[Survived] StringLiteral
tools/trident-tools.ts:181:33
       args: {
         targetPath: z.string().describe('Absolute path to the project root to audit'),
-        action: z.enum(['full', 'quick', 'preflight-only']).default('full').describe('Audit depth: full=preflight+17 layers+artifact, quick=17 layers+artifact, preflight-only=just tsc+build+dist'),
+        action: z.enum(['full', "", 'preflight-only']).default('full').describe('Audit depth: full=preflight+17 layers+artifact, quick=17 layers+artifact, preflight-only=just tsc+build+dist'),
       },
       execute: async (args) => {

[Survived] ArrayDeclaration
tools/trident-tools.ts:181:24
       args: {
         targetPath: z.string().describe('Absolute path to the project root to audit'),
-        action: z.enum(['full', 'quick', 'preflight-only']).default('full').describe('Audit depth: full=preflight+17 layers+artifact, quick=17 layers+artifact, preflight-only=just tsc+build+dist'),
+        action: z.enum([]).default('full').describe('Audit depth: full=preflight+17 layers+artifact, quick=17 layers+artifact, preflight-only=just tsc+build+dist'),
       },
       execute: async (args) => {

[Survived] ConditionalExpression
tools/trident-tools.ts:184:13
         action: z.enum(['full', 'quick', 'preflight-only']).default('full').describe('Audit depth: full=preflight+17 layers+artifact, quick=17 layers+artifact, preflight-only=just tsc+build+dist'),
       },
       execute: async (args) => {
-        if (!(await fileExists(args.targetPath))) {
+        if (false) {
           throw new Error('targetPath does not exist: ' + args.targetPath);
         }

[Survived] BlockStatement
tools/trident-tools.ts:184:51
         action: z.enum(['full', 'quick', 'preflight-only']).default('full').describe('Audit depth: full=preflight+17 layers+artifact, quick=17 layers+artifact, preflight-only=just tsc+build+dist'),
       },
       execute: async (args) => {
-        if (!(await fileExists(args.targetPath))) {
-          throw new Error('targetPath does not exist: ' + args.targetPath);
-        }
+        if (!(await fileExists(args.targetPath))) {}
         try {
           orchestrator.startAudit();

[Survived] StringLiteral
tools/trident-tools.ts:185:27
       },
       execute: async (args) => {
         if (!(await fileExists(args.targetPath))) {
-          throw new Error('targetPath does not exist: ' + args.targetPath);
+          throw new Error("" + args.targetPath);
         }
         try {

[Survived] BlockStatement
tools/trident-tools.ts:191:49
           orchestrator.startAudit();
           const projectName = await resolveProjectName(args.targetPath);
 
-          if (args.action === 'preflight-only') {
-            const { runPreflight } = await import('../audit-engine/preflight.js');
-            const result = await runPreflight(args.targetPath);
-            return JSON.stringify({
-              action: 'preflight-only',
-              targetPath: args.targetPath,
-              typeCheckPassed: result.typeCheckPassed,
-              buildPassed: result.buildPassed,
-              distExists: result.distExists,
-              distIsSingleFile: result.distIsSingleFile,
-              distSizeKB: (result.distSize / 1024).toFixed(1),
-              sourceMapExists: result.sourceMapExists,
-              findings: result.findings,
-              typeCheckError: result.typeCheckError,
-              buildError: result.buildError,
-            }, null, 2);
-          }
+          if (args.action === 'preflight-only') {}
 
           if (args.action === 'full') {

[Survived] EqualityOperator
tools/trident-tools.ts:191:15
           orchestrator.startAudit();
           const projectName = await resolveProjectName(args.targetPath);
 
-          if (args.action === 'preflight-only') {
+          if (args.action !== 'preflight-only') {
             const { runPreflight } = await import('../audit-engine/preflight.js');
             const result = await runPreflight(args.targetPath);

[Survived] ArithmeticOperator
tools/trident-tools.ts:201:28
               buildPassed: result.buildPassed,
               distExists: result.distExists,
               distIsSingleFile: result.distIsSingleFile,
-              distSizeKB: (result.distSize / 1024).toFixed(1),
+              distSizeKB: (result.distSize * 1024).toFixed(1),
               sourceMapExists: result.sourceMapExists,
               findings: result.findings,

[Survived] EqualityOperator
tools/trident-tools.ts:209:15
             }, null, 2);
           }
 
-          if (args.action === 'full') {
+          if (args.action !== 'full') {
             orchestrator.completeLayer();
           }

[Survived] ConditionalExpression
tools/trident-tools.ts:209:15
             }, null, 2);
           }
 
-          if (args.action === 'full') {
+          if (false) {
             orchestrator.completeLayer();
           }

[Survived] ConditionalExpression
tools/trident-tools.ts:215:15
 
           const engine = new AuditEngine();
           let result;
-          if (args.action === 'quick') {
+          if (false) {
             result = await engine.audit(args.targetPath);
           } else {

[Survived] EqualityOperator
tools/trident-tools.ts:215:15
 
           const engine = new AuditEngine();
           let result;
-          if (args.action === 'quick') {
+          if (args.action !== 'quick') {
             result = await engine.audit(args.targetPath);
           } else {

[Survived] BlockStatement
tools/trident-tools.ts:217:18
           let result;
           if (args.action === 'quick') {
             result = await engine.audit(args.targetPath);
-          } else {
-            result = await engine.auditWithPreflight(args.targetPath);
-          }
+          } else {}
           orchestrator.completeLayer();
 

[Survived] ObjectLiteral
tools/trident-tools.ts:224:26
 
           const artifact = generateCodeReviewArtifact(result, args.targetPath, projectName, 'trident');
           const mdPath = await writeArtifactFile('CODE_REVIEW', artifact);
-          storeArtifacts({
-            'code-review': artifact,
-            'artifact-path': mdPath,
-            'raw-audit-result': JSON.stringify({ score: result.score, grade: result.grade, findings: result.findings.length }),
-          });
+          storeArtifacts({});
 
           if (!result || typeof result.score !== 'number') {

[Survived] BlockStatement
tools/trident-tools.ts:230:60
             'raw-audit-result': JSON.stringify({ score: result.score, grade: result.grade, findings: result.findings.length }),
           });
 
-          if (!result || typeof result.score !== 'number') {
-            orchestrator.failLayer('Invalid audit result');
-          }
+          if (!result || typeof result.score !== 'number') {}
 
           return artifact + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '');

[Survived] ConditionalExpression
tools/trident-tools.ts:230:26
             'raw-audit-result': JSON.stringify({ score: result.score, grade: result.grade, findings: result.findings.length }),
           });
 
-          if (!result || typeof result.score !== 'number') {
+          if (!result || false) {
             orchestrator.failLayer('Invalid audit result');
           }

[Survived] StringLiteral
tools/trident-tools.ts:231:36
           });
 
           if (!result || typeof result.score !== 'number') {
-            orchestrator.failLayer('Invalid audit result');
+            orchestrator.failLayer("");
           }
 

[Survived] ArithmeticOperator
tools/trident-tools.ts:234:18
             orchestrator.failLayer('Invalid audit result');
           }
 
-          return artifact + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '');
+          return artifact - (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '')
         } catch (err: unknown) {
           const errorId = `AUDIT-ERR-${Date.now()}`;

[Survived] BlockStatement
tools/trident-tools.ts:235:32
           }
 
           return artifact + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '');
-        } catch (err: unknown) {
-          const errorId = `AUDIT-ERR-${Date.now()}`;
-          const errMsg = err instanceof Error ? err.message : String(err);
-          tridentLog('ERROR', 'trident-code-audit', `[${errorId}] ${errMsg}`);
-          return JSON.stringify({
-            error: 'Code audit failed',
-            errorId,
-            message: errMsg,
-            targetPath: args.targetPath,
-          }, null, 2);
-        }
+        } catch (err: unknown) {}
       },
     }),

[Survived] ObjectLiteral
tools/trident-tools.ts:239:33
           const errorId = `AUDIT-ERR-${Date.now()}`;
           const errMsg = err instanceof Error ? err.message : String(err);
           tridentLog('ERROR', 'trident-code-audit', `[${errorId}] ${errMsg}`);
-          return JSON.stringify({
-            error: 'Code audit failed',
-            errorId,
-            message: errMsg,
-            targetPath: args.targetPath,
-          }, null, 2);
+          return JSON.stringify({}, null, 2);
         }
       },

[Survived] StringLiteral
tools/trident-tools.ts:252:41
     'trident-deep-planning': tool({
       args: {
-        targetPath: z.string().describe('Absolute path to the project root'),
+        targetPath: z.string().describe(""),
         requirements: z.string().describe('What this project needs to do — requirements text'),
         architecture: z.string().describe('Architecture description — how the system is structured'),

[Survived] StringLiteral
tools/trident-tools.ts:254:43
       args: {
         targetPath: z.string().describe('Absolute path to the project root'),
         requirements: z.string().describe('What this project needs to do — requirements text'),
-        architecture: z.string().describe('Architecture description — how the system is structured'),
+        architecture: z.string().describe(""),
         patterns: z.array(z.string()).optional().describe('Known patterns to include in context library'),
         failures: z.array(z.string()).optional().describe('Known failure modes to document'),

[Survived] StringLiteral
tools/trident-tools.ts:255:59
         targetPath: z.string().describe('Absolute path to the project root'),
         requirements: z.string().describe('What this project needs to do — requirements text'),
         architecture: z.string().describe('Architecture description — how the system is structured'),
-        patterns: z.array(z.string()).optional().describe('Known patterns to include in context library'),
+        patterns: z.array(z.string()).optional().describe(""),
         failures: z.array(z.string()).optional().describe('Known failure modes to document'),
         decisions: z.array(z.string()).optional().describe('Design decisions already made'),

[Survived] StringLiteral
tools/trident-tools.ts:256:59
         requirements: z.string().describe('What this project needs to do — requirements text'),
         architecture: z.string().describe('Architecture description — how the system is structured'),
         patterns: z.array(z.string()).optional().describe('Known patterns to include in context library'),
-        failures: z.array(z.string()).optional().describe('Known failure modes to document'),
+        failures: z.array(z.string()).optional().describe(""),
         decisions: z.array(z.string()).optional().describe('Design decisions already made'),
       },

[Survived] StringLiteral
tools/trident-tools.ts:257:60
         architecture: z.string().describe('Architecture description — how the system is structured'),
         patterns: z.array(z.string()).optional().describe('Known patterns to include in context library'),
         failures: z.array(z.string()).optional().describe('Known failure modes to document'),
-        decisions: z.array(z.string()).optional().describe('Design decisions already made'),
+        decisions: z.array(z.string()).optional().describe(""),
       },
       execute: async (args) => {

[Survived] ConditionalExpression
tools/trident-tools.ts:260:13
         decisions: z.array(z.string()).optional().describe('Design decisions already made'),
       },
       execute: async (args) => {
-        if (!(await fileExists(args.targetPath))) {
+        if (true) {
           throw new Error('targetPath does not exist: ' + args.targetPath);
         }

[Survived] ConditionalExpression
tools/trident-tools.ts:268:15
           const projectName = await resolveProjectName(args.targetPath);
 
           const v1 = deepPlanningModule.validateLayerContent(1, args.requirements + ' ' + args.architecture);
-          if (v1.valid) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 1: ${v1.missing.join(', ')}`); }
+          if (false) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 1: ${v1.missing.join(', ')}`); }
 
           const buildSpec = generateBuildSpecArtifact(

[Survived] BlockStatement
tools/trident-tools.ts:268:64
           const projectName = await resolveProjectName(args.targetPath);
 
           const v1 = deepPlanningModule.validateLayerContent(1, args.requirements + ' ' + args.architecture);
-          if (v1.valid) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 1: ${v1.missing.join(', ')}`); }
+          if (v1.valid) { orchestrator.completeLayer(); } else {}
 
           const buildSpec = generateBuildSpecArtifact(

[Survived] ConditionalExpression
tools/trident-tools.ts:277:15
             args.architecture
           );
           const v2 = deepPlanningModule.validateLayerContent(2, buildSpec);
-          if (v2.valid) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 2: ${v2.missing.join(', ')}`); }
+          if (true) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 2: ${v2.missing.join(', ')}`); }
 
           const contextLib = generateContextLibraryManifest(

[Survived] BlockStatement
tools/trident-tools.ts:277:64
             args.architecture
           );
           const v2 = deepPlanningModule.validateLayerContent(2, buildSpec);
-          if (v2.valid) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 2: ${v2.missing.join(', ')}`); }
+          if (v2.valid) { orchestrator.completeLayer(); } else {}
 
           const contextLib = generateContextLibraryManifest(

[Survived] ConditionalExpression
tools/trident-tools.ts:282:13
           const contextLib = generateContextLibraryManifest(
             projectName,
             args.architecture,
-            args.patterns || [],
+            false,
             args.failures || [],
             args.decisions || []

[Survived] ConditionalExpression
tools/trident-tools.ts:282:13
           const contextLib = generateContextLibraryManifest(
             projectName,
             args.architecture,
-            args.patterns || [],
+            true,
             args.failures || [],
             args.decisions || []

[Survived] LogicalOperator
tools/trident-tools.ts:283:13
             projectName,
             args.architecture,
             args.patterns || [],
-            args.failures || [],
+            args.failures && [],
             args.decisions || []
           );

[Survived] ConditionalExpression
tools/trident-tools.ts:283:13
             projectName,
             args.architecture,
             args.patterns || [],
-            args.failures || [],
+            true,
             args.decisions || []
           );

[Survived] ConditionalExpression
tools/trident-tools.ts:284:13
             args.architecture,
             args.patterns || [],
             args.failures || [],
-            args.decisions || []
+            false
           );
           const v3 = deepPlanningModule.validateLayerContent(3, contextLib);

[Survived] ConditionalExpression
tools/trident-tools.ts:284:13
             args.architecture,
             args.patterns || [],
             args.failures || [],
-            args.decisions || []
+            true
           );
           const v3 = deepPlanningModule.validateLayerContent(3, contextLib);

[Survived] ConditionalExpression
tools/trident-tools.ts:287:15
             args.decisions || []
           );
           const v3 = deepPlanningModule.validateLayerContent(3, contextLib);
-          if (v3.valid) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 3: ${v3.missing.join(', ')}`); }
+          if (true) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 3: ${v3.missing.join(', ')}`); }
 
           const combined = buildSpec + '\n\n---\n\n' + contextLib;

[Survived] BlockStatement
tools/trident-tools.ts:287:25
             args.decisions || []
           );
           const v3 = deepPlanningModule.validateLayerContent(3, contextLib);
-          if (v3.valid) { orchestrator.completeLayer(); } else { orchestrator.failLayer(`Layer 3: ${v3.missing.join(', ')}`); }
+          if (v3.valid) {} else { orchestrator.failLayer(`Layer 3: ${v3.missing.join(', ')}`); }
 
           const combined = buildSpec + '\n\n---\n\n' + contextLib;

[Survived] ObjectLiteral
tools/trident-tools.ts:299:13
           });
 
           const validations = [
-            { layer: 1, name: 'INITIAL PLAN', ...v1 },
+            {},
             { layer: 2, name: 'DETAILED WORKFLOW', ...v2 },
             { layer: 3, name: 'CONTEXT LIBRARY', ...v3 },

[Survived] StringLiteral
tools/trident-tools.ts:301:31
           const validations = [
             { layer: 1, name: 'INITIAL PLAN', ...v1 },
             { layer: 2, name: 'DETAILED WORKFLOW', ...v2 },
-            { layer: 3, name: 'CONTEXT LIBRARY', ...v3 },
+            { layer: 3, name: "", ...v3 },
           ];
           return combined + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '') + '\n\n---\n\n' + formatValidationReport(validations, 'DEEP_PLANNING');

[Survived] ArithmeticOperator
tools/trident-tools.ts:303:18
             { layer: 2, name: 'DETAILED WORKFLOW', ...v2 },
             { layer: 3, name: 'CONTEXT LIBRARY', ...v3 },
           ];
-          return combined + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '') + '\n\n---\n\n' + formatValidationReport(validations, 'DEEP_PLANNING');
+          return combined - (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '')+ '\n\n---\n\n' + formatValidationReport(validations, 'DEEP_PLANNING');
         } catch (err: unknown) {
           const errMsg = err instanceof Error ? err.message : String(err);

[Survived] StringLiteral
tools/trident-tools.ts:303:39
             { layer: 2, name: 'DETAILED WORKFLOW', ...v2 },
             { layer: 3, name: 'CONTEXT LIBRARY', ...v3 },
           ];
-          return combined + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '') + '\n\n---\n\n' + formatValidationReport(validations, 'DEEP_PLANNING');
+          return combined + (mdPath ? ``: '') + '\n\n---\n\n' + formatValidationReport(validations, 'DEEP_PLANNING');
         } catch (err: unknown) {
           const errMsg = err instanceof Error ? err.message : String(err);

[Survived] BlockStatement
tools/trident-tools.ts:304:32
             { layer: 3, name: 'CONTEXT LIBRARY', ...v3 },
           ];
           return combined + (mdPath ? `\n\n---\n📄 Artifact saved: \`${mdPath}\`` : '') + '\n\n---\n\n' + formatValidationReport(validations, 'DEEP_PLANNING');
-        } catch (err: unknown) {
-          const errMsg = err instanceof Error ? err.message : String(err);
-          const errorId = `PLAN-ERR-${Date.now()}`;
-          tridentLog('ERROR', 'trident-deep-planning', `[${errorId}] ${errMsg}`);
-          return JSON.stringify({ error: 'Deep planning failed', errorId, message: (err instanceof Error ? err.message : String(err)) }, null, 2);
-        }
+        } catch (err: unknown) {}
       },
     }),

[Survived] StringLiteral
tools/trident-tools.ts:307:31
         } catch (err: unknown) {
           const errMsg = err instanceof Error ? err.message : String(err);
           const errorId = `PLAN-ERR-${Date.now()}`;
-          tridentLog('ERROR', 'trident-deep-planning', `[${errorId}] ${errMsg}`);
+          tridentLog('ERROR', "", `[${errorId}] ${errMsg}`);
           return JSON.stringify({ error: 'Deep planning failed', errorId, message: (err instanceof Error ? err.message : String(err)) }, null, 2);
         }

[Survived] ObjectLiteral
tools/trident-tools.ts:308:33
           const errMsg = err instanceof Error ? err.message : String(err);
           const errorId = `PLAN-ERR-${Date.now()}`;
           tridentLog('ERROR', 'trident-deep-planning', `[${errorId}] ${errMsg}`);
-          return JSON.stringify({ error: 'Deep planning failed', errorId, message: (err instanceof Error ? err.message : String(err)) }, null, 2);
+          return JSON.stringify({}, null, 2);
         }
       },

[Survived] StringLiteral
tools/trident-tools.ts:316:41
     'trident-problem-solving': tool({
       args: {
-        targetPath: z.string().describe('Absolute path to the affected project'),
+        targetPath: z.string().describe(""),
         problem: z.string().describe('Problem statement — what is broken or wrong'),
         reasoning: z.array(z.string()).describe('Reasoning chain steps. Use "observation|hypothesis|evidence|conclusion" pipe format for best table output'),

[Survived] StringLiteral
tools/trident-tools.ts:317:38
       args: {
         targetPath: z.string().describe('Absolute path to the affected project'),
-        problem: z.string().describe('Problem statement — what is broken or wrong'),
+        problem: z.string().describe(""),
         reasoning: z.array(z.string()).describe('Reasoning chain steps. Use "observation|hypothesis|evidence|conclusion" pipe format for best table output'),
         workingPlan: z.array(z.string()).describe('Working plan phases. Use "description|files|expected outcome|risk|rollback" pipe format for best table output'),
