[Survived] BlockStatement
utils.ts:7:57
 // Lazy EvidenceStore initialization with sql.js (in-memory SQLite, no native deps)
 let _evidenceStore: any = null;
 
-async function getOrCreateEvidenceStore(): Promise<any> {
-  if (!_evidenceStore) {
-    try {
-      const { EvidenceStore } = await import('./evidence/evidence-store.js');
-      _evidenceStore = new EvidenceStore();
-    } catch {
-      // sql.js not available — use in-memory fallback
-      _evidenceStore = fallbackStore;
-    }
-  }
-  return _evidenceStore;
-}
+async function getOrCreateEvidenceStore(): Promise<any> {}
 
 const fallbackStore = {

[Survived] ConditionalExpression
utils.ts:8:7
 let _evidenceStore: any = null;
 
 async function getOrCreateEvidenceStore(): Promise<any> {
-  if (!_evidenceStore) {
+  if (true) {
     try {
       const { EvidenceStore } = await import('./evidence/evidence-store.js');

[Survived] BlockStatement
utils.ts:8:24
 let _evidenceStore: any = null;
 
 async function getOrCreateEvidenceStore(): Promise<any> {
-  if (!_evidenceStore) {
-    try {
-      const { EvidenceStore } = await import('./evidence/evidence-store.js');
-      _evidenceStore = new EvidenceStore();
-    } catch {
-      // sql.js not available — use in-memory fallback
-      _evidenceStore = fallbackStore;
-    }
-  }
+  if (!_evidenceStore) {}
   return _evidenceStore;
 }

[Survived] BlockStatement
utils.ts:9:9
 
 async function getOrCreateEvidenceStore(): Promise<any> {
   if (!_evidenceStore) {
-    try {
-      const { EvidenceStore } = await import('./evidence/evidence-store.js');
-      _evidenceStore = new EvidenceStore();
-    } catch {
+    try {} catch {
       // sql.js not available — use in-memory fallback
       _evidenceStore = fallbackStore;

[Survived] BlockStatement
utils.ts:12:13
     try {
       const { EvidenceStore } = await import('./evidence/evidence-store.js');
       _evidenceStore = new EvidenceStore();
-    } catch {
-      // sql.js not available — use in-memory fallback
-      _evidenceStore = fallbackStore;
-    }
+    } catch {}
   }
   return _evidenceStore;

[Survived] ArrowFunction
utils.ts:21:11
 }
 
 const fallbackStore = {
-  append: () => Promise.resolve(),
+  append: () => undefined,
   queryBySession: () => Promise.resolve([]),
   queryByMode: () => Promise.resolve([]),

[Survived] ArrowFunction
utils.ts:22:19
 
 const fallbackStore = {
   append: () => Promise.resolve(),
-  queryBySession: () => Promise.resolve([]),
+  queryBySession: () => undefined,
   queryByMode: () => Promise.resolve([]),
   queryByLayer: () => Promise.resolve([]),

[Survived] ArrayDeclaration
utils.ts:22:41
 
 const fallbackStore = {
   append: () => Promise.resolve(),
-  queryBySession: () => Promise.resolve([]),
+  queryBySession: () => Promise.resolve(["Stryker was here"]),
   queryByMode: () => Promise.resolve([]),
   queryByLayer: () => Promise.resolve([]),

[Survived] ArrowFunction
utils.ts:23:16
 const fallbackStore = {
   append: () => Promise.resolve(),
   queryBySession: () => Promise.resolve([]),
-  queryByMode: () => Promise.resolve([]),
+  queryByMode: () => undefined,
   queryByLayer: () => Promise.resolve([]),
   queryByTimestamp: () => Promise.resolve([]),

[Survived] ArrayDeclaration
utils.ts:23:38
 const fallbackStore = {
   append: () => Promise.resolve(),
   queryBySession: () => Promise.resolve([]),
-  queryByMode: () => Promise.resolve([]),
+  queryByMode: () => Promise.resolve(["Stryker was here"]),
   queryByLayer: () => Promise.resolve([]),
   queryByTimestamp: () => Promise.resolve([]),

[Survived] ArrowFunction
utils.ts:24:17
   append: () => Promise.resolve(),
   queryBySession: () => Promise.resolve([]),
   queryByMode: () => Promise.resolve([]),
-  queryByLayer: () => Promise.resolve([]),
+  queryByLayer: () => undefined,
   queryByTimestamp: () => Promise.resolve([]),
   queryBySessionAndMode: () => Promise.resolve([]),

[Survived] ArrayDeclaration
utils.ts:24:39
   append: () => Promise.resolve(),
   queryBySession: () => Promise.resolve([]),
   queryByMode: () => Promise.resolve([]),
-  queryByLayer: () => Promise.resolve([]),
+  queryByLayer: () => Promise.resolve(["Stryker was here"]),
   queryByTimestamp: () => Promise.resolve([]),
   queryBySessionAndMode: () => Promise.resolve([]),

[Survived] ArrowFunction
utils.ts:25:21
   queryBySession: () => Promise.resolve([]),
   queryByMode: () => Promise.resolve([]),
   queryByLayer: () => Promise.resolve([]),
-  queryByTimestamp: () => Promise.resolve([]),
+  queryByTimestamp: () => undefined,
   queryBySessionAndMode: () => Promise.resolve([]),
   compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),

[Survived] ArrowFunction
utils.ts:26:26
   queryByMode: () => Promise.resolve([]),
   queryByLayer: () => Promise.resolve([]),
   queryByTimestamp: () => Promise.resolve([]),
-  queryBySessionAndMode: () => Promise.resolve([]),
+  queryBySessionAndMode: () => undefined,
   compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),
   verifyChain: () => Promise.resolve({ valid: true, brokenAt: null }),

[Survived] ArrowFunction
utils.ts:27:12
   queryByLayer: () => Promise.resolve([]),
   queryByTimestamp: () => Promise.resolve([]),
   queryBySessionAndMode: () => Promise.resolve([]),
-  compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),
+  compact: () => undefined,
   verifyChain: () => Promise.resolve({ valid: true, brokenAt: null }),
   close: () => Promise.resolve(),

[Survived] ObjectLiteral
utils.ts:27:34
   queryByLayer: () => Promise.resolve([]),
   queryByTimestamp: () => Promise.resolve([]),
   queryBySessionAndMode: () => Promise.resolve([]),
-  compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),
+  compact: () => Promise.resolve({}),
   verifyChain: () => Promise.resolve({ valid: true, brokenAt: null }),
   close: () => Promise.resolve(),

[Survived] BooleanLiteral
utils.ts:28:47
   queryByTimestamp: () => Promise.resolve([]),
   queryBySessionAndMode: () => Promise.resolve([]),
   compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),
-  verifyChain: () => Promise.resolve({ valid: true, brokenAt: null }),
+  verifyChain: () => Promise.resolve({ valid: false, brokenAt: null }),
   close: () => Promise.resolve(),
 };

[Survived] ArrowFunction
utils.ts:28:16
   queryByTimestamp: () => Promise.resolve([]),
   queryBySessionAndMode: () => Promise.resolve([]),
   compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),
-  verifyChain: () => Promise.resolve({ valid: true, brokenAt: null }),
+  verifyChain: () => undefined,
   close: () => Promise.resolve(),
 };

[Survived] ArrowFunction
utils.ts:29:10
   queryBySessionAndMode: () => Promise.resolve([]),
   compact: () => Promise.resolve({ deleted: 0, newRootHash: '' }),
   verifyChain: () => Promise.resolve({ valid: true, brokenAt: null }),
-  close: () => Promise.resolve(),
+  close: () => undefined,
 };
 

[Survived] BlockStatement
utils.ts:32:100
   close: () => Promise.resolve(),
 };
 
-export async function tridentLog(level: string, component: string, message: string): Promise<void> {
-  if (!process.env.TRIDENT_DEBUG) return;
-  try {
-    const store = await getOrCreateEvidenceStore();
-    store.append('global', 'SYSTEM', 'R0', `log:${level}`, { source: component, message, timestamp: Date.now() });
-  } catch {
-    // Silently discard if evidence store is unavailable
-  }
-}
+export async function tridentLog(level: string, component: string, message: string): Promise<void> {}
 
 export function getEvidenceStore(): Promise<any> {

[Survived] ConditionalExpression
utils.ts:33:7
 };
 
 export async function tridentLog(level: string, component: string, message: string): Promise<void> {
-  if (!process.env.TRIDENT_DEBUG) return;
+  if (false) return;
   try {
     const store = await getOrCreateEvidenceStore();

[Survived] ConditionalExpression
utils.ts:33:7
 };
 
 export async function tridentLog(level: string, component: string, message: string): Promise<void> {
-  if (!process.env.TRIDENT_DEBUG) return;
+  if (true) return;
   try {
     const store = await getOrCreateEvidenceStore();

[Survived] BlockStatement
utils.ts:34:7
 
 export async function tridentLog(level: string, component: string, message: string): Promise<void> {
   if (!process.env.TRIDENT_DEBUG) return;
-  try {
-    const store = await getOrCreateEvidenceStore();
-    store.append('global', 'SYSTEM', 'R0', `log:${level}`, { source: component, message, timestamp: Date.now() });
-  } catch {
+  try {} catch {
     // Silently discard if evidence store is unavailable
   }

[Survived] StringLiteral
utils.ts:36:18
   if (!process.env.TRIDENT_DEBUG) return;
   try {
     const store = await getOrCreateEvidenceStore();
-    store.append('global', 'SYSTEM', 'R0', `log:${level}`, { source: component, message, timestamp: Date.now() });
+    store.append("", 'SYSTEM', 'R0', `log:${level}`, { source: component, message, timestamp: Date.now() });
   } catch {
     // Silently discard if evidence store is unavailable

[Survived] BlockStatement
utils.ts:42:50
   }
 }
 
-export function getEvidenceStore(): Promise<any> {
-  return getOrCreateEvidenceStore();
-}
+export function getEvidenceStore(): Promise<any> {}
 
 // Re-export all existing utility functions unchanged

[Survived] LogicalOperator
utils.ts:52:26
 import * as path from 'path';
 import { Finding, SEVERITY, Severity } from './types.js';
 
-const TRIDENT_LOG_PATH = process.env.TRIDENT_LOG_PATH || path.join(os.tmpdir(), 'trident-engine.log');
+const TRIDENT_LOG_PATH = process.env.TRIDENT_LOG_PATH && path.join(os.tmpdir(), 'trident-engine.log');
 const TRIDENT_FALLBACK_LOG = path.join(os.tmpdir(), 'trident-error.log');
 

[Survived] ConditionalExpression
utils.ts:52:26
 import * as path from 'path';
 import { Finding, SEVERITY, Severity } from './types.js';
 
-const TRIDENT_LOG_PATH = process.env.TRIDENT_LOG_PATH || path.join(os.tmpdir(), 'trident-engine.log');
+const TRIDENT_LOG_PATH = false;
 const TRIDENT_FALLBACK_LOG = path.join(os.tmpdir(), 'trident-error.log');
 

[Survived] ObjectLiteral
utils.ts:55:50
 const TRIDENT_LOG_PATH = process.env.TRIDENT_LOG_PATH || path.join(os.tmpdir(), 'trident-engine.log');
 const TRIDENT_FALLBACK_LOG = path.join(os.tmpdir(), 'trident-error.log');
 
-const SEVERITY_ORDER: Record<Severity, number> = {
-  [SEVERITY.CRITICAL]: 4,
-  [SEVERITY.HIGH]: 3,
-  [SEVERITY.MEDIUM]: 2,
-  [SEVERITY.LOW]: 1,
-  [SEVERITY.INFO]: 0,
-};
+const SEVERITY_ORDER: Record<Severity, number> = {};
 
 export function shortFile(filePath: string): string {

[Survived] BlockStatement
utils.ts:63:53
   [SEVERITY.INFO]: 0,
 };
 
-export function shortFile(filePath: string): string {
-  if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
-  const parts = filePath.replace(/\\/g, '/').split('/');
-  const fileName = parts[parts.length - 1] || filePath;
-  const lineMatch = filePath.match(/:(\d+)$/);
-  if (lineMatch) {
-    const base = fileName.replace(/:\d+$/, '');
-    return `${base}:${lineMatch[1]}`;
-  }
-  return fileName;
-}
+export function shortFile(filePath: string): string {}
 
 export function confidenceLabel(confidence: number): string {

[Survived] ConditionalExpression
utils.ts:64:39
 };
 
 export function shortFile(filePath: string): string {
-  if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
+  if (typeof filePath !== 'string' || false) return '<unknown>';
   const parts = filePath.replace(/\\/g, '/').split('/');
   const fileName = parts[parts.length - 1] || filePath;

[Survived] EqualityOperator
utils.ts:64:7
 };
 
 export function shortFile(filePath: string): string {
-  if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
+  if (typeof filePath === 'string' || filePath.length === 0) return '<unknown>';
   const parts = filePath.replace(/\\/g, '/').split('/');
   const fileName = parts[parts.length - 1] || filePath;

[Survived] StringLiteral
utils.ts:65:41
 
 export function shortFile(filePath: string): string {
   if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
-  const parts = filePath.replace(/\\/g, '/').split('/');
+  const parts = filePath.replace(/\\/g, "").split('/');
   const fileName = parts[parts.length - 1] || filePath;
   const lineMatch = filePath.match(/:(\d+)$/);

[Survived] ArithmeticOperator
utils.ts:66:26
 export function shortFile(filePath: string): string {
   if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
   const parts = filePath.replace(/\\/g, '/').split('/');
-  const fileName = parts[parts.length - 1] || filePath;
+  const fileName = parts[parts.length + 1] || filePath;
   const lineMatch = filePath.match(/:(\d+)$/);
   if (lineMatch) {

[Survived] ConditionalExpression
utils.ts:66:20
 export function shortFile(filePath: string): string {
   if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
   const parts = filePath.replace(/\\/g, '/').split('/');
-  const fileName = parts[parts.length - 1] || filePath;
+  const fileName = true;
   const lineMatch = filePath.match(/:(\d+)$/);
   if (lineMatch) {

[Survived] Regex
utils.ts:67:36
   if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
   const parts = filePath.replace(/\\/g, '/').split('/');
   const fileName = parts[parts.length - 1] || filePath;
-  const lineMatch = filePath.match(/:(\d+)$/);
+  const lineMatch = filePath.match(/:(\d)$/);
   if (lineMatch) {
     const base = fileName.replace(/:\d+$/, '');

[Survived] Regex
utils.ts:67:36
   if (typeof filePath !== 'string' || filePath.length === 0) return '<unknown>';
   const parts = filePath.replace(/\\/g, '/').split('/');
   const fileName = parts[parts.length - 1] || filePath;
-  const lineMatch = filePath.match(/:(\d+)$/);
+  const lineMatch = filePath.match(/:(\d+)/);
   if (lineMatch) {
     const base = fileName.replace(/:\d+$/, '');

[Survived] ConditionalExpression
utils.ts:68:7
   const parts = filePath.replace(/\\/g, '/').split('/');
   const fileName = parts[parts.length - 1] || filePath;
   const lineMatch = filePath.match(/:(\d+)$/);
-  if (lineMatch) {
+  if (false) {
     const base = fileName.replace(/:\d+$/, '');
     return `${base}:${lineMatch[1]}`;

[Survived] BlockStatement
utils.ts:68:18
   const parts = filePath.replace(/\\/g, '/').split('/');
   const fileName = parts[parts.length - 1] || filePath;
   const lineMatch = filePath.match(/:(\d+)$/);
-  if (lineMatch) {
-    const base = fileName.replace(/:\d+$/, '');
-    return `${base}:${lineMatch[1]}`;
-  }
+  if (lineMatch) {}
   return fileName;
 }

[Survived] BlockStatement
utils.ts:75:61
   return fileName;
 }
 
-export function confidenceLabel(confidence: number): string {
-  if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
-  if (confidence >= 0.9) return 'CRITICAL';
-  if (confidence >= 0.7) return 'HIGH';
-  if (confidence >= 0.4) return 'MEDIUM';
-  return 'LOW';
-}
+export function confidenceLabel(confidence: number): string {}
 
 export function deduplicateFindings(findings: Finding[]): Finding[] {

[Survived] ConditionalExpression
utils.ts:76:7
 }
 
 export function confidenceLabel(confidence: number): string {
-  if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
+  if (false) return 'LOW';
   if (confidence >= 0.9) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';

[Survived] ConditionalExpression
utils.ts:76:7
 }
 
 export function confidenceLabel(confidence: number): string {
-  if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
+  if (false || isNaN(confidence)) return 'LOW';
   if (confidence >= 0.9) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';

[Survived] ConditionalExpression
utils.ts:77:7
 
 export function confidenceLabel(confidence: number): string {
   if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
-  if (confidence >= 0.9) return 'CRITICAL';
+  if (true) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';
   if (confidence >= 0.4) return 'MEDIUM';

[Survived] EqualityOperator
utils.ts:77:7
 
 export function confidenceLabel(confidence: number): string {
   if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
-  if (confidence >= 0.9) return 'CRITICAL';
+  if (confidence < 0.9) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';
   if (confidence >= 0.4) return 'MEDIUM';

[Survived] EqualityOperator
utils.ts:78:7
 export function confidenceLabel(confidence: number): string {
   if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
   if (confidence >= 0.9) return 'CRITICAL';
-  if (confidence >= 0.7) return 'HIGH';
+  if (confidence < 0.7) return 'HIGH';
   if (confidence >= 0.4) return 'MEDIUM';
   return 'LOW';

[Survived] ConditionalExpression
utils.ts:78:7
 export function confidenceLabel(confidence: number): string {
   if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
   if (confidence >= 0.9) return 'CRITICAL';
-  if (confidence >= 0.7) return 'HIGH';
+  if (false) return 'HIGH';
   if (confidence >= 0.4) return 'MEDIUM';
   return 'LOW';

[Survived] EqualityOperator
utils.ts:79:7
   if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
   if (confidence >= 0.9) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';
-  if (confidence >= 0.4) return 'MEDIUM';
+  if (confidence > 0.4) return 'MEDIUM';
   return 'LOW';
 }

[Survived] ConditionalExpression
utils.ts:79:7
   if (typeof confidence !== 'number' || isNaN(confidence)) return 'LOW';
   if (confidence >= 0.9) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';
-  if (confidence >= 0.4) return 'MEDIUM';
+  if (false) return 'MEDIUM';
   return 'LOW';
 }

[Survived] StringLiteral
utils.ts:80:10
   if (confidence >= 0.9) return 'CRITICAL';
   if (confidence >= 0.7) return 'HIGH';
   if (confidence >= 0.4) return 'MEDIUM';
-  return 'LOW';
+  return "";
 }
 

[Survived] BlockStatement
utils.ts:83:69
   return 'LOW';
 }
 
-export function deduplicateFindings(findings: Finding[]): Finding[] {
-  if (!Array.isArray(findings)) return [];
-  const bucket = new Map<string, Finding>();
-  for (const f of findings) {
-    if (!f || typeof f !== 'object') continue;
-    const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
-    const existing = bucket.get(loc);
-    if (!existing) {
-      bucket.set(loc, f);
-      continue;
-    }
-    const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
-    const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
-    if (currentRank > existingRank) {
-      bucket.set(loc, f);
-    }
-  }
-  return Array.from(bucket.values());
-}
+export function deduplicateFindings(findings: Finding[]): Finding[] {}
 
 export function parseVersion(versionStr: string): { major: number; minor: number; patch: number } {

[Survived] ConditionalExpression
utils.ts:84:7
 }
 
 export function deduplicateFindings(findings: Finding[]): Finding[] {
-  if (!Array.isArray(findings)) return [];
+  if (true) return [];
   const bucket = new Map<string, Finding>();
   for (const f of findings) {

[Survived] BooleanLiteral
utils.ts:84:7
 }
 
 export function deduplicateFindings(findings: Finding[]): Finding[] {
-  if (!Array.isArray(findings)) return [];
+  if (Array.isArray(findings)) return [];
   const bucket = new Map<string, Finding>();
   for (const f of findings) {

[Survived] BlockStatement
utils.ts:86:29
 export function deduplicateFindings(findings: Finding[]): Finding[] {
   if (!Array.isArray(findings)) return [];
   const bucket = new Map<string, Finding>();
-  for (const f of findings) {
-    if (!f || typeof f !== 'object') continue;
-    const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
-    const existing = bucket.get(loc);
-    if (!existing) {
-      bucket.set(loc, f);
-      continue;
-    }
-    const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
-    const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
-    if (currentRank > existingRank) {
-      bucket.set(loc, f);
-    }
-  }
+  for (const f of findings) {}
   return Array.from(bucket.values());
 }

[Survived] ConditionalExpression
utils.ts:87:15
   if (!Array.isArray(findings)) return [];
   const bucket = new Map<string, Finding>();
   for (const f of findings) {
-    if (!f || typeof f !== 'object') continue;
+    if (!f || false) continue;
     const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
     const existing = bucket.get(loc);

[Survived] ConditionalExpression
utils.ts:87:9
   if (!Array.isArray(findings)) return [];
   const bucket = new Map<string, Finding>();
   for (const f of findings) {
-    if (!f || typeof f !== 'object') continue;
+    if (false) continue;
     const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
     const existing = bucket.get(loc);

[Survived] LogicalOperator
utils.ts:88:20
   const bucket = new Map<string, Finding>();
   for (const f of findings) {
     if (!f || typeof f !== 'object') continue;
-    const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
+    const loc = `${f.file && ''}:${f.line ?? 'x'}:${f.category || ''}`;
     const existing = bucket.get(loc);
     if (!existing) {

[Survived] ConditionalExpression
utils.ts:88:53
   const bucket = new Map<string, Finding>();
   for (const f of findings) {
     if (!f || typeof f !== 'object') continue;
-    const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
+    const loc = `${f.file || ''}:${f.line ?? 'x'}:${true}`;
     const existing = bucket.get(loc);
     if (!existing) {

[Survived] ConditionalExpression
utils.ts:90:9
     if (!f || typeof f !== 'object') continue;
     const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
     const existing = bucket.get(loc);
-    if (!existing) {
+    if (false) {
       bucket.set(loc, f);
       continue;

[Survived] BooleanLiteral
utils.ts:90:9
     if (!f || typeof f !== 'object') continue;
     const loc = `${f.file || ''}:${f.line ?? 'x'}:${f.category || ''}`;
     const existing = bucket.get(loc);
-    if (!existing) {
+    if (existing) {
       bucket.set(loc, f);
       continue;

[Survived] UnaryOperator
utils.ts:94:63
       bucket.set(loc, f);
       continue;
     }
-    const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
+    const existingRank = SEVERITY_ORDER[existing.severity] ?? +1;
     const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
     if (currentRank > existingRank) {

[Survived] LogicalOperator
utils.ts:94:26
       bucket.set(loc, f);
       continue;
     }
-    const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
+    const existingRank = SEVERITY_ORDER[existing.severity] && -1;
     const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
     if (currentRank > existingRank) {

[Survived] LogicalOperator
utils.ts:95:25
       continue;
     }
     const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
-    const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
+    const currentRank = SEVERITY_ORDER[f.severity] && -1;
     if (currentRank > existingRank) {
       bucket.set(loc, f);

[Survived] UnaryOperator
utils.ts:95:55
       continue;
     }
     const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
-    const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
+    const currentRank = SEVERITY_ORDER[f.severity] ?? +1;
     if (currentRank > existingRank) {
       bucket.set(loc, f);

[Survived] EqualityOperator
utils.ts:96:9
     }
     const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
     const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
-    if (currentRank > existingRank) {
+    if (currentRank >= existingRank) {
       bucket.set(loc, f);
     }

[Survived] EqualityOperator
utils.ts:96:9
     }
     const existingRank = SEVERITY_ORDER[existing.severity] ?? -1;
     const currentRank = SEVERITY_ORDER[f.severity] ?? -1;
-    if (currentRank > existingRank) {
+    if (currentRank <= existingRank) {
       bucket.set(loc, f);
     }

[Survived] BlockStatement
utils.ts:103:99
   return Array.from(bucket.values());
 }
 
-export function parseVersion(versionStr: string): { major: number; minor: number; patch: number } {
-  const defaultResult = { major: 1, minor: 0, patch: 0 };
-  if (typeof versionStr !== 'string' || versionStr.length === 0) return defaultResult;
-  const cleaned = versionStr.replace(/^V/i, '');
-  const parts = cleaned.split('.').map(Number);
-  const safe = (v: number): number => (isNaN(v) ? 0 : Math.max(0, v));
-  return { major: safe(parts[0] ?? 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
-}
+export function parseVersion(versionStr: string): { major: number; minor: number; patch: number } {}
 
 export function formatVersion(major: number, minor: number, patch: number): string {

[Survived] ConditionalExpression
utils.ts:105:7
 
 export function parseVersion(versionStr: string): { major: number; minor: number; patch: number } {
   const defaultResult = { major: 1, minor: 0, patch: 0 };
-  if (typeof versionStr !== 'string' || versionStr.length === 0) return defaultResult;
+  if (false) return defaultResult;
   const cleaned = versionStr.replace(/^V/i, '');
   const parts = cleaned.split('.').map(Number);

[Survived] ConditionalExpression
utils.ts:105:7
 
 export function parseVersion(versionStr: string): { major: number; minor: number; patch: number } {
   const defaultResult = { major: 1, minor: 0, patch: 0 };
-  if (typeof versionStr !== 'string' || versionStr.length === 0) return defaultResult;
+  if (false || versionStr.length === 0) return defaultResult;
   const cleaned = versionStr.replace(/^V/i, '');
   const parts = cleaned.split('.').map(Number);

[Survived] MethodExpression
utils.ts:108:55
   if (typeof versionStr !== 'string' || versionStr.length === 0) return defaultResult;
   const cleaned = versionStr.replace(/^V/i, '');
   const parts = cleaned.split('.').map(Number);
-  const safe = (v: number): number => (isNaN(v) ? 0 : Math.max(0, v));
+  const safe = (v: number): number => (isNaN(v) ? 0 : Math.min(0, v));
   return { major: safe(parts[0] ?? 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
 }

[Survived] ArrowFunction
utils.ts:108:16
   if (typeof versionStr !== 'string' || versionStr.length === 0) return defaultResult;
   const cleaned = versionStr.replace(/^V/i, '');
   const parts = cleaned.split('.').map(Number);
-  const safe = (v: number): number => (isNaN(v) ? 0 : Math.max(0, v));
+  const safe = () => undefined;
   return { major: safe(parts[0] ?? 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
 }

[Survived] LogicalOperator
utils.ts:109:24
   const cleaned = versionStr.replace(/^V/i, '');
   const parts = cleaned.split('.').map(Number);
   const safe = (v: number): number => (isNaN(v) ? 0 : Math.max(0, v));
-  return { major: safe(parts[0] ?? 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
+  return { major: safe(parts[0] && 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
 }
 

[Survived] LogicalOperator
utils.ts:109:52
   const cleaned = versionStr.replace(/^V/i, '');
   const parts = cleaned.split('.').map(Number);
   const safe = (v: number): number => (isNaN(v) ? 0 : Math.max(0, v));
-  return { major: safe(parts[0] ?? 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
+  return { major: safe(parts[0] ?? 0), minor: safe(parts[1] && 0), patch: safe(parts[2] ?? 0) };
 }
 

[Survived] BlockStatement
utils.ts:112:84
   return { major: safe(parts[0] ?? 0), minor: safe(parts[1] ?? 0), patch: safe(parts[2] ?? 0) };
 }
 
-export function formatVersion(major: number, minor: number, patch: number): string {
-  const safe = (v: number): number => { const n = typeof v === 'number' && !isNaN(v) ? v : 0; return Math.max(0, n); };
-  return `V${safe(major)}.${safe(minor)}.${safe(patch)}`;
-}
+export function formatVersion(major: number, minor: number, patch: number): string {}
 

[Survived] ConditionalExpression
utils.ts:113:51
 }
 
 export function formatVersion(major: number, minor: number, patch: number): string {
-  const safe = (v: number): number => { const n = typeof v === 'number' && !isNaN(v) ? v : 0; return Math.max(0, n); };
+  const safe = (v: number): number => { const n = false ? v : 0; return Math.max(0, n); };
   return `V${safe(major)}.${safe(minor)}.${safe(patch)}`;
 }

[Survived] BooleanLiteral
utils.ts:113:76
 }
 
 export function formatVersion(major: number, minor: number, patch: number): string {
-  const safe = (v: number): number => { const n = typeof v === 'number' && !isNaN(v) ? v : 0; return Math.max(0, n); };
+  const safe = (v: number): number => { const n = typeof v === 'number' && isNaN(v) ? v : 0; return Math.max(0, n); };
   return `V${safe(major)}.${safe(minor)}.${safe(patch)}`;
 }
